[
  {
    "element_id": 28,
    "page_number": 3,
    "normalized_text": "The table contains the following information: Sr. No. Contents 1. Company Overview 2. Corporate Profile 3. Message from Managing Director 4. Corporate Information 5. Management Discussion and Analysis 6. Director Report Declaration Regarding Adherence to the Code of Conduct Certificate from Practicing Company Secretary on Compliance of Conditions of Corporate Governance Certificate of Non-Disqualification of Directors Managing Director & CFO Certification Annexure-1 (Details Pertaining to Employees) Annexure-2 (AOC - 1) Annexure-3 (AOC - 2) Annexure-4 (MR - 3) Annexure-5 (MR-3 - of Material Subsidiary) 7. Corporate Governance Report 8. Auditor’s Report (Standalone) 9. Financial Statements (Standalone) 10. Auditor’s Report (Consolidated) 11. Financial Statements (Consolidated) 12. Notice of 42nd Annual General Meeting Page Nos. 3 4-5 6-7 8-9 10-18 19-50 34 35 36-37 38 39-40 41 42 43-46 47-50 51-75 76-87 88-115 116-124 125-152 153-167."
  },
  {
    "element_id": 180,
    "page_number": 16,
    "normalized_text": "The table contains the following information: Strengths Distinct Relationship-Based Business Model The company operates on a relationship-driven business approach, enabling personalized financial solutions backed by extensive experience in credit appraisal and collections. This model not only enhances customer loyalty but also strengthens risk management capabilities. Proven and Consistent Financial Performance Over the years, the company has demonstrated a stable and consistent financial track record, reflecting its operational efficiency, prudent financial management, and strategic growth initiatives. Experienced Senior Management Team The company benefits from a highly skilled leadership team with deep industry knowledge and expertise across critical financial domains. Their strategic decision-making and operational oversight play a pivotal role in driving sustainable growth. Robust Institutional and Market Relationships Strong and enduring relationships with public sector units, private entities, and institutional clients position the company advantageously within the competitive landscape. These connections facilitate consistent deal flow and expansion opportunities. Opportunity Expanding Demand for Working Capital Financing There is a significant market opportunity to address the working capital needs of businesses, individuals, and the MSME sector. With limited access to traditional banking channels, these segments seek alternative financing solutions, positioning the company for growth. Weaknesses Dependence on National Economic Growth The company’s business expansion and revenue generation remain significantly influenced by the overall economic performance of the country. Economic slowdowns directly impact lending volumes and asset quality. Vulnerability of Borrower Segment A considerable portion of the borrower base, particularly MSMEs and individual borrowers, is more susceptible to adverse macroeconomic conditions, exposing the company to heightened credit risk during downturns. Threats Inflationary Pressures Persistent inflation can erode consumers’ purchasing power and increase operational costs, thereby reducing credit uptake and potentially impacting the company’s profitability. Rising Competition The financial services sector is witnessing increased competition from captive finance arms."
  },
  {
    "element_id": 192,
    "page_number": 17,
    "normalized_text": "The table contains the following information: S.No. Ratios March, 31, 2025 March,31, 2024 Ratios Ratio 1 Current Ratio 13.05 16.13 2 Debt- Equity Ratio 0.06 0.05 3 Debt-Service Coverage Ratio 4.57 0.00 4 Return on Equity Ratio 0.06 0.04 5 Inventory Turnover Ratio - - 6 Trade Receivable Turnover Ratio 0.08 0.07 7 Trade Payable Turnover Ratio - -."
  },
  {
    "element_id": 194,
    "page_number": 17,
    "normalized_text": "The table contains the following information: S.No. Ratios March, 31, 2025 March, 31, 2024 Ratios Ratios 1 Current Ratio 9.97 10.50 2 Debt-Equity Ratio 0.05 0.03 3 Debt Service Coverage Ratio 4.63 1.73 4 Return on Equity Ratio 0.07 0.04 5 Inventory Turnover Ratio - - 6 Trade Receivable Turnover Ratio 0.29 0.25."
  },
  {
    "element_id": 226,
    "page_number": 20,
    "normalized_text": "The table contains the following information: Particulars 2024-25 2023-24 Revenue from Operations Impairment of Financial Instrument 165.32 30.85 Other Income 116.08 Total Income 281.40 Profit/(Loss) Before Interest & Dep. 219.30 Less: Interest 7.61 Less: Depreciation 3.41 Profit / (Loss) Before Tax 208.28 Less: Current Tax 58.34 Less: Deferred Tax (9.66) Less: Prior Period Tax (4.49) Net Profit After Tax 164.09."
  },
  {
    "element_id": 248,
    "page_number": 21,
    "normalized_text": "The table contains the following information: Particulars 2024-25 Revenue from Operations 492.95 Other Income 117.09 Total Income 610.05 Profit/(Loss) Before Interest & Dep. 421.15 Less: Interest 42.04 Less: Depreciation 11.13 Profit / (Loss) Before Tax 367.99 Less: Current Tax 58.34 Less: Deferred Tax (11.05) Less: Prior Period Tax (4.49) Net Profit After Tax 325.19."
  },
  {
    "element_id": 283,
    "page_number": 22,
    "normalized_text": "The table contains the following information: Details of the Subsidiary Name Venkatswamy Mining and Estates Private Limited CIN U01131DL2012PTC238155 Date of Incorporation 27-06-2012 Holding percentage 51 % Name of Statutory Kamal Gupta Associates (FRN: 000752C), Reappointed on Auditor 24.09.2023."
  },
  {
    "element_id": 463,
    "page_number": 35,
    "normalized_text": "The table contains the following information: Sd/- Sd/- Vimal Kumar Sharma Deepak Agarwal (Managing Director) (Director) DIN: 02247228."
  },
  {
    "element_id": 490,
    "page_number": 37,
    "normalized_text": "The table contains the following information: S. No. NAME OF THE DIRECTOR DIN DESIGNATION CATEGORY DATE OF APPOINTMENT 1. VIMAL KUMAR SHARMA 00954083 Managing Director Executive Director 13/10/2020 2. DEEPAK AGARWAL 02247228 Director Non- 19/05/2018 Executive Director 3. AMAN PREET KAUR 09711954 Director Non-Executive 14/08/2024 Director 4. SEEMA MITTAL 06948908 Director Executive 14/08/2014 Director 5. VIJAY KUMAR JAIN 08208856 Director Non-Executive 28/05/2019 Director."
  },
  {
    "element_id": 493,
    "page_number": 38,
    "normalized_text": "The table contains the following information: Sd/- Place: Kanpur CS GOPESH SAHU Date: 01/07/2025 FCS: 7100, CP: 7800 UDIN: F007100G000686845 Peer Review Certificate No.: 1515/2021."
  },
  {
    "element_id": 506,
    "page_number": 39,
    "normalized_text": "The table contains the following information: S/d S/d Date: 28.05.2025 Vimal Kumar Sharma Seema Mittal Place: Kanpur (Managing Director) (Chief Financial Officer)."
  },
  {
    "element_id": 513,
    "page_number": 40,
    "normalized_text": "The table contains the following information: Sl. Requirement of Rule 5(1) Disclosure No. 1 The ratio of the remuneration of each (Managing Director) Nil director to the median remuneration of (Other Director) – Nil the employees for the financial year 2 Percentage increase in remuneration of Percentage increase in remuneration of:- each director, CFO, CEO, CS or a) Directors - Nil Manager in the financial year b) MD – Nil c) CFO – No Increase d) CEO -NA e) Company Secretary – No Increase f) Manager –Nil 3 The percentage increase/decrease in the The median remuneration of the median remuneration of employees in Employees the financial year decreased by 1.77 % in the financial year. 4 The number of permanent employees on There were 06 employees on permanent the rolls of the company roll of the company as on March 31, 2025. 5 Average percentile increase already There was no increase in the managerial made in the salaries of employees other remuneration in the Financial year. than the managerial personnel in the last financial year i.e. 2024-25 and its comparison with the percentile increase in the managerial remuneration and justification thereof and point out if there are any exceptional circumstances for increase in the managerial remuneration 6 Affirmation that the remuneration is as We affirm that the remuneration paid to per the remuneration policy of the employees and KMP’s was based on the company remuneration policy.."
  },
  {
    "element_id": 531,
    "page_number": 42,
    "normalized_text": "The table contains the following information: S. Particulars 01 Name Venkatswamy Mining And Estates 02 Reporting Period 01.04.2024-31.03.2025 03 Reporting Currency INR 04 Share Capital 5,00,00,000.00 05 Reserves & Surplus 13,15,23,456.00 06 Total Assets 20,95,71,785.00 07 Total Liabilities 20,95,71,785.00 08 Investments NIL 09 Turnover 32,76,37,776 10 Profit before tax 1,59,70,378.00 11 Provision for -1,39,233.00 taxation(Deferred Tax) 12 Profit after Taxation 1,61,09,611.00 13 Proposed Dividend Nil."
  },
  {
    "element_id": 752,
    "page_number": 53,
    "normalized_text": "The table contains the following information: S.No. Name of Category of Relationshi No. of Name & No. of Committee Director Directorship p between Directorships Categories of position(s) in other at Sulabh Directors held in Public Directors in Public Companies*# inter-se Companies(incl other Listed uding Deemed Companies Public Companies) *Member #Chairperson 1. Mr. Vimal Managing No 1 Nil Nil Nil Kumar Director Sharma 2. Mrs. Seema Executive No Nil Nil Nil Nil Mittal Women Director and Chief Financial Officer 3. Mr. Deepak Independent No 1 Nil Nil Nil Agarwal director 4. Mr. Rakesh Independent No 1 (till 11.11.24) Nil Nil Nil Chand Director Agarwal (till 08.03.2025) 5. Mr. Vijay Independent No 1 1 2 Nil Kumar Jain Director 6. Mrs. Aman Independent No 2 Nil 2 2 Preet Kaur Director (w.e.f."
  },
  {
    "element_id": 806,
    "page_number": 54,
    "normalized_text": "The table contains the following information: DIRECTORS SKILL/ EXPERTISE/ COMPETENCIES NAME OF THE DIRECTOR Skills identified and area of core expertise 1.Vimal Kumar Sharma ®@ A e ut T Ser 2.Seema Mittal ry T Py A T se A & T 5.Vijay Kumar Jain PY 8 T 6.Aman Preet Kaur** A 8 T See Py 3.Deepak Agarwal 4. Rakesh Chand Agarwal* Lrr EL >) @ O O Ee O Or O BPE PREE i oe |."
  },
  {
    "element_id": 857,
    "page_number": 57,
    "normalized_text": "The table contains the following information: S.No. Name of Director DIN Initial Date of Date of Re- Category Appointment appointment 1 Vimal Kumar Sharma 00954083 13-10-2020 25-09-2021 Managing Director 2 Seema Mittal 06948908 14-08-2014 25-09-2021 Women Director - Executive Director &CFO 3 Deepak Agarwal 02247228 19-05-2018 25-09-2018 Non- Executive Independent Director 4 Rakesh Chand Agarwal 03539915 30-09-2011 29-09-2020 Non-Executive Independent (Resignation Director w.e.f 08.03.2025) 5 Vijay Kumar Jain 08208856 28-05-2019 28-09-2019 Non- Executive Independent Director 6 Aman Preet Kaur 09711954 14.08.2024 - Non- Executive Independent Director."
  },
  {
    "element_id": 861,
    "page_number": 57,
    "normalized_text": "The table contains the following information: Name of DIN Category of No. of No. of Last Other Committee Position Shareholdi Director Directorship Board Board AGM Directorship Chairman/ Member ng (No.of Meetings Meetings Attended as on person Shares) Held Attended 31.03.2025 Mr.Vimal 00954083 Managing 08 08 YES 05 NIL 02 NIL Kumar Director Sharma Mrs. Seema 06948908 Executive 08 08 YES NIL NIL 01 NIL Mittal Director & Mr. Deepak 02247228 Independent 08 08 YES 01 01 01 NIL Agarwal Director Mr. Rakesh 03539915 Independent 08 08 YES NIL 02 01 NIL Chand Director (till - (till - Agarwal 08.03.2025) 08.03.2025) Mr. Vijay 08208856 Independent 08 05 YES 01 NIL 01 NIL Kumar Jain Director Mrs. Aman 09711954 Independent 08 04 YES 02 02 (w.e.f 01 (w.e.f NIL Preet Kaur Director 30.09.2024) 30.09.20 24)."
  },
  {
    "element_id": 914,
    "page_number": 60,
    "normalized_text": "The table contains the following information: Sr.No. Name Category Designation 1 Mr. Deepak Agarwal Independent Chairman 2 Mr. Rakesh Chand Agarwal Independent Member 3 Mr. Vimal Kumar Sharma Non-Independent Member."
  },
  {
    "element_id": 916,
    "page_number": 60,
    "normalized_text": "The table contains the following information: S.NO Name Category Designation 1. Mr. Deepak Agarwal Independent Chairman 2. Mr. Rakesh Chand Agarwal Independent Member 3. Mr. Vimal Kumar Sharma Non- Independent Member 4. Mrs. Aman Preet Kaur Independent Member."
  },
  {
    "element_id": 918,
    "page_number": 60,
    "normalized_text": "The table contains the following information: S.NO Name Category Designation 1. Mr. Deepak Agarwal Independent Chairman 3. Mr. Vimal Kumar Sharma Non- Independent Member 4. Mrs. Aman Preet Kaur Independent Member."
  },
  {
    "element_id": 926,
    "page_number": 61,
    "normalized_text": "The table contains the following information: Name Category Designation No. of Meetings (2024-25) Held Eligible Attended Mr. Deepak Independent Chairman 05 05 05 Agarwal Mr. Rakesh Independent Member (till 8th 05 05 05 Chand Agarwal March, 2025) Mr. Vimal Non- Member 05 05 05 Kumar Sharma Independent Mrs. Aman Preet Independent Member (w.e.f 30th 05 02 02 kaur September 2024)."
  },
  {
    "element_id": 946,
    "page_number": 62,
    "normalized_text": "The table contains the following information: Sr. Name Category Designation No. 1 Mr. Rakesh Chand Agarwal Independent Chairman 2 Mr. Deepak Agarwal Independent Member 3 Mr. Vijay Kumar Jain Independent Member."
  },
  {
    "element_id": 948,
    "page_number": 62,
    "normalized_text": "The table contains the following information: Sr. Name Category Designation No. 1 Mr. Rakesh Chand Agarwal Independent Chairman 2 Mr. Deepak Agarwal Independent Member 3 Mr. Vijay Kumar Jain Independent Member 4 Mrs. Aman Preet Kaur Independent Member."
  },
  {
    "element_id": 950,
    "page_number": 62,
    "normalized_text": "The table contains the following information: Sr. Name Category Designation No. 1 Mrs. Aman Preet Kaur Independent Chairperson 2 Mr. Deepak Agarwal Independent Member 3 Mr. Vijay Kumar Jain Independent Member."
  },
  {
    "element_id": 954,
    "page_number": 62,
    "normalized_text": "The table contains the following information: Name Category Designation No. of Meetings (2024-25) Held Eligible Attended Mr. Rakesh Independent Chairman (till 8th 02 02 02 Chand Agarwal March 2025) Mr. Deepak Independent Member 02 02 02 Agarwal Mr. Vijay Kumar Independent Member 02 02 02 Jain."
  },
  {
    "element_id": 956,
    "page_number": 63,
    "normalized_text": "The table contains the following information: Mrs. Aman Preet Independent Member (From 02 00 00 Kaur 30th September, 2024 till 8th March 2025) Chairperson (from 8th March 2025)."
  },
  {
    "element_id": 975,
    "page_number": 64,
    "normalized_text": "The table contains the following information: Sr.No. Name Category Designation 1 Mr. Rakesh Chand Agarwal Independent Chairman 2 Mr. Vimal Kumar Sharma Non-Independent Member 3 Mrs. Seema Mittal Non-Independent Member."
  },
  {
    "element_id": 977,
    "page_number": 64,
    "normalized_text": "The table contains the following information: Sr.No. Name Category Designation 1 Mr. Rakesh Chand Agarwal Independent Chairman 2 Mr. Vimal Kumar Sharma Non-Independent Member 3 Mrs. Seema Mittal Non-Independent Member 4 Mrs. Aman Preet Kaur Non-executive Independent Member."
  },
  {
    "element_id": 979,
    "page_number": 64,
    "normalized_text": "The table contains the following information: Sr.No. Name Category Designation 1 Mrs. Aman Preet Kaur Non-executive Independent Chairperson 2 Mr. Vimal Kumar Sharma Non-Independent Member 3 Mrs. Seema Mittal Non-Independent Member."
  },
  {
    "element_id": 982,
    "page_number": 64,
    "normalized_text": "The table contains the following information: Name Category Designation No. of Meetings Held Eligible Attended Mr. Rakesh Independent Chairman till 8th 4 04 04 Chand Agarwal March, 2025 Mr. Vimal Non-Independent Member 4 04 04 Kumar Sharma Mrs. Seema Non-Independent Member 4 04 04 Mittal Mrs. Aman Preet Independent Member till 8th of 4 02 02 Kaur March 2025. Chairperson from 8th of March 2025 onwards 63."
  },
  {
    "element_id": 995,
    "page_number": 65,
    "normalized_text": "The table contains the following information: S.No. Name and Designation Salary Other Benefits Total 01 Mr. Vimal Kumar Nil Nil Nil Sharma Manging Director 02 Mr. Deepak Agarwal Nil Nil Nil Independent Director 03 Mr. Rakesh Chand Nil Nil Nil Agarwal Independent Director 04 Mrs. Seema Mittal 180000/- Nil 180000/- CFO cum Director 05 Mr. Vijay Kumar Jain Nil Nil Nil."
  },
  {
    "element_id": 1006,
    "page_number": 66,
    "normalized_text": "The table contains the following information: For Date of Venue of Meeting Timing of Financial Meeting Meeting Year 2020-21 25/09/2021 Held through Video Conferencing/Other Audio Visual 1:00 P.M. Means (“VC/OAVM”) pursuant to notifications issued by Ministry of Corporate Affairs 2021-22 29/09/2022 Held through Video Conferencing/Other Audio Visual 1:00 P.M. Means (“VC/OAVM”) pursuant to notifications issued by Ministry of Corporate Affairs 2022-23 25/09/2023 Held through Video Conferencing/Other Audio Visual 1:00 P.M. Means (“VC/OAVM”) pursuant to notifications issued by Ministry of Corporate Affairs 2023-24 28/09/2024 Held through Video Conferencing/Other Audio Visual 11:00 A.M Means (“VC/OAVM”) pursuant to notifications issued by Ministry of Corporate Affairs."
  },
  {
    "element_id": 1008,
    "page_number": 66,
    "normalized_text": "The table contains the following information: S.No. Year Special Resolution(s) 1. 2023-24 1. Appointment of Ms. Aman Preet Kaur (DIN: 09711954) as an Independent Director of the Company. 2.Re-appointment of Mr. Vijay Kumar Jain (DIN: 08208856) as Independent Director of the Company. 2. 2022-23 1.Re-appointment of Mr. Deepak Agarwal (DIN: 02247228) as an Independent Director of the Company."
  },
  {
    "element_id": 1034,
    "page_number": 67,
    "normalized_text": "The table contains the following information: BSE LIMITED ISIN CIN 508969 INE673M01029 L28920MH1983PLC029879."
  },
  {
    "element_id": 1036,
    "page_number": 67,
    "normalized_text": "The table contains the following information: MONTH HIGH (Rs.) LOW (Rs.) VOLUME Apr-24 6 4.91 16,01,310.00 May-24 6.01 4.51 15,23,066.00 Jun-24 5.95 4.55 14,53,937.00 Jul-24 6.42 5.01 17,68,312.00."
  },
  {
    "element_id": 1042,
    "page_number": 68,
    "normalized_text": "The table contains the following information: Sep-24 6.36 5.01 14,97,042.00 Oct-24 6.9 4.7 15,06,599.00 Nov-24 5.45 4.72 5,70,855.00 Dec-24 5.6 4.66 7,79,104.00 Jan-25 5.83 4.4 15,35,265.00 Feb-25 4.9 3.02 16,44,387.00 Mar-25 3.88 3 16,52,553.00."
  },
  {
    "element_id": 1052,
    "page_number": 68,
    "normalized_text": "The table contains the following information: Category No. of Shares % of Holding A) Promoters Holding Individuals 22683437 22.58 Bodies Corporate 3000000 2.99 Sub-Total (A) 25683437 25.56 B) Non-Promoters Holding Bodies Corporate 15382406 15.31."
  },
  {
    "element_id": 1054,
    "page_number": 69,
    "normalized_text": "The table contains the following information: Individuals 54820210 54.55 HUF 3943380 3.92 TRUST 10 0 Non-Resident Indians 159175 0.16 NBFC Registered with RBI 15945 0.02 Clearing Members/House 1907 0 IEPF 3000 0 OTHERS 465530 0.47 Sub-Total (B) 74791563 74.44 Grand Total (A+B) 100475000 100."
  },
  {
    "element_id": 1059,
    "page_number": 69,
    "normalized_text": "The table contains the following information: Share or Debenture Number of % to Total Share or Debenture % to Total holding Nominal Shareholders Numbers holding Amount Amount Value (Rs.) (Rs.) 1 2 3 4 5 Up To 5,000 18979 96.65 6894145.00 6.86 5001 To 10,000 290 1.48 2185097.00 2.17 10001 To 20,000 131 0.67 1960619.00 1.95 20001 To 30,000 60 0.31 1494608.00 1.49 30001 To 40,000 25 0.13 899048.00 0.89 40001 To 50,000 15 0.08 695738.00 0.69 50001 To 1,00,000 39 0.20 2943516.00 2.93 1,00,000 and Above 98 0.50 83402229.00 83.01."
  },
  {
    "element_id": 1068,
    "page_number": 70,
    "normalized_text": "The table contains the following information: Forms Purpose ISR-1 Request for registering PAN, KYC details or Changes/Updation thereof ISR-2 Confirmation of Signature of securities holder by the Banker SH-13 Nomination form ISR-3 Declaration to Opt-out for Nomination SH-14 Change in Nomination (Cancellation or Variation of Nominations) Members may access the above forms from website of the company at https://www.sulabh.org.in/upload/PDF/00000298.pdf https://www.sulabh.org.in/upload/PDF/00000297.pdf https://www.sulabh.org.in/upload/PDF/00000296.pdf https://www.sulabh.org.in/upload/PDF/00000295.pdf https://www.sulabh.org.in/upload/PDF/00000294.pdf."
  },
  {
    "element_id": 1110,
    "page_number": 73,
    "normalized_text": "The table contains the following information: S. Particulars Status No. 1 Number of Complaints during the Financial Year Nil 2 Number of Complaints disposed off Nil 3 Number of Complaints pending Nil."
  },
  {
    "element_id": 1132,
    "page_number": 74,
    "normalized_text": "The table contains the following information: Name Venkatswamy Mining and Estates Private Limited CIN U01131DL2012PTC238155 Date of Incorporation 27-06-2012 Holding percentage 51 % Name of Statutory Kamal Gupta Associates (FRN: 000752C), Reappointed on Auditor 24.09.2023."
  },
  {
    "element_id": 1235,
    "page_number": 83,
    "normalized_text": "The table contains the following information: Particulars All parties Promoters Subsidiary Aggregate amount of loan and advances in the nature of 1448.49 Nil 269.28 loans repayable on demand or period of repayment Percentage of loans & advances in the nature of 100 Nil 18.59 loans to the total loans."
  },
  {
    "element_id": 1299,
    "page_number": 89,
    "normalized_text": "The table contains the following information: Sulabh Engineers & Services Limited Balance Sheet Particulars Note No ASSETS 1) Financial Assets (a) Cash and cash equivalents 2.1 (b) Loans 2.2 (c) Investments 2.3 (d) Other Financial assets 2.4 2) Non-financial Assets (a) Deferred tax Assets (Net) 2.5 (b) Property, Plant and Equipment 2.6 (c) Other Non-Financial assets 2.7 Total Assets LIABILITIES AND EQUITY LIABILITIES 1) Financial Liabilities (a) Payables 2.8 (I) Other Payables (i) total outstanding dues of micro enterprises and small enterprises (ii) total outstanding dues of creditors other than micro and small enterprises (b) Borrowings (Other than debt securities) 2.9 2) Non-Financial Liabilities (a) Current tax liabilities (Net) 2.10 (b) Provisions 2.11 (c) Deferred tax liabilities (Net) 2.5 3) EQUITY (a) Equity Share capital 2.12 (b) Other Equity 2.13 Total Liabilities and Equity Summary of significant accounting policies The accompanying notes are an integral part of the financial statements. As per our report of even date (Rs. In Lakhs) As at 31 March 2025 2024 5.62 7.40 1,448.49 955.68 887.33 1,110.46 23.18 13.27 2,364.62 2,086.81 10.92 2.57 299.25 330.25 446.40 431.46 756.57 764.28 3,121.19 2,851.09 - - 16.49 2.00 164.71 127.39 181.20 129.39 58.34 4.99 5.98 3.83 1.29 2.60 65.62 11.42 1,004.75 1,004.75 1,869.62 1,705.53 2,874.37 2,710.28 3,121.19 2,851.09."
  },
  {
    "element_id": 1327,
    "page_number": 90,
    "normalized_text": "The table contains the following information: Sulabh Engineers & Services Limited Statement of profit and loss Particulars Note No Revenue from operations Interest Income 3.1 Net gain on fair value changes 3.2 Total Revenue from operations Other Income (to be specified) 3.3 Total Income Expenses Finance Costs 3.4 Impairment on financial instruments 3.5 Employee Benefits Expenses 3.6 Depreciation, amortization and impairment 2.6 Others expenses 3.7 Total Expenses Profit/(loss) before tax Tax Expense: (1) Current Tax (2) Prior Period Tax (3) Deferred Tax Profit/(loss) for the year Other Comprehensive Income 3.8 (A) (i) Items that will not be reclassified to profit or loss (ii) Income tax relating to items that will not be reclassified to profit or loss (B) (i) Items that will be reclassified to profit or loss (ii) Income tax relating to items that will be reclassified to profit or loss Other Comprehensive Income for the year (net of tax) Total Comprehensive Income for the year Earnings per equity share (for continuing and discontinued operations) 3.9 Basic (Rs.) Diluted (Rs.) Summary of significant accounting policies The accompanying notes are an integral part of the financial statements. As per our report of even date For Ranjit Jain & Co. Chartered Accountants (Rs. In Lakhs) For the year ended 31 March 2025 2024 160.17 129.01 5.14 12.68 165.32 141.69 116.08 81.15 281.40 222.84 7.61 0.39 30.85 -2.69 10.13 10.31 3.41 4.39 21.12 55.76 73.12 68.16 208.28 154.67 58.34 40.00 -4.49 6.14 -9.66 2.85 164.09 105.68 - - - - - - - - - - 164.09 105.68 0.16 0.11 0.16 0.11 For and on behalf of Board of Directors."
  },
  {
    "element_id": 1351,
    "page_number": 91,
    "normalized_text": "The table contains the following information: Sulabh Engineers & Services Limited Statement of Cash Flow Particulars (A) CASH FLOWFROM OPERATING ACTIVITIES Net Profit before tax as per statement of Profit and loss Adjustments for : Depreciation & amortisation Investment fair value adjustment Impairment on Financial Instruments Others Operating profit before working capital changes Adjustment for: (Increase) /Decrease in Loans (Increase) /Decrease in Other financial and Non-Financial Assets (Increase) /Decrease in Investments (Decrease)/Increase in Other Financial and Non-Financial Liabilities Cash generated from operations Income Tax NET CASH FLOWS FROM OPERATING ACTIVITIES (B) CASH FLOW FROM INVESTING ACTIVITIES Payment for purchase and construction of property, plant and equipment Purchase of Property, Plant and Equipment including WIP, Investments etc Others NET CASH FLOWS FROM INVESTING ACTIVITIES ( C ) CASH FLOWS FROM FINANCING ACTIVITIES NET CASH FLOWS FROM FINANCING ACTIVITIES Net increase / (decrease) in cash and cash equivalents Cash and cash equivalents at the beginning of the year Cash and cash equivalents at the end of the year As per our report of even date For Ranjit Jain & Co. Chartered Accountants FRN : 322505E (Rs. In Lakhs) For the year ended 31 March 2025 2024 208.28 154.68 3.41 4.39 -5.14 -12.68 30.85 -2.69 1.98 1.47 239.38 145.17 -492.81 554.03 -50.55 -442.90 223.13 -566.56 105.33 125.92 24.48 -184.35 -53.85 -43.45 -29.37 -227.80 - - 27.59 -0.59 - 0.10 27.59 -0.49 - - -1.78 -228.29 7.40 235.69 5.62 7.40 For and on behalf of Board of Directors."
  },
  {
    "element_id": 1375,
    "page_number": 92,
    "normalized_text": "The table contains the following information: Statement of Changes in Equity Equity share capital Particulars Balance at the beginning of the year Changes in equity share capital during the year Balance at the end of the year Rs in Lakhs For the year ended 31 March 2025 2024 1,004.75 1,004.75 - - 1,004.75 1,004.75."
  },
  {
    "element_id": 1377,
    "page_number": 92,
    "normalized_text": "The table contains the following information: For the year ended 31 March 2025 Particulars Balance as at 31 March 2024 Profit after tax Other comprehensive income (net of tax) Transfer to reserve fund in terms of section 45-IC(1) of the Reserve Bank of India Act, 1934 Others Balance as at 31 March 2025 For the year ended 31 March 2024 Particulars Balance as at 31 March 2023 Profit after tax Other comprehensive income (net of tax) Transfer to reserve fund in terms of section 45-IC(1) of the Reserve Bank of India Act, 1934 Others Balance as at 31 March 2024 As per our report of even date For Ranjit Jain & Co. Chartered Accountants FRN :322505E CA Ashok Kumar Agarwal Partner Membership No. : 056622 - Place: Mumbai Date: May 28, 2025 Secutities Premium 980.00 - - 980.00 - - - 980.00 Secutities Premium 980.00 - - 980.00 - - - 980.00 Reserves and surplus Retained Reserve fund earnings as per RBI Act 573.48 128.04 164.09 - - - 737.57 128.04 -32.82 32.82 - - -32.82 32.82 704.75 160.86 Reserves and surplus Retained Reserve fund earnings as per RBI Act 488.93 106.90 105.69 - - - 594.62 106.90 -21.14 21.14 - - -21.14 21.14 573.48 128.04 General reserve 24.01 - - 24.01 - - - 24.01 General reserve 24.01 - - 24.01 - - - 24.01 sd/- Vimal Kumar Sharma Managing Director DIN: 00954083 sd/- Chief Financial Officer Seema Mittal PAN: CCAPM1399E Rs in Lakhs Other Total other comprehensive equity income - 1,705.53 - 164.09 - - - 1,869.62 - - - - - - - 1,869.62 Other Total other comprehensive equity income - 1,599.84 - 105.69 - - - 1,705.53 - - - - - - - 1,705.53 For and on behalf of Board of Directors sd/- Aman Preet Kaur Director DIN: 09711954 sd/- Company Secretary Amit Kumar Kanaujia PAN: CNSPK8778G."
  },
  {
    "element_id": 1381,
    "page_number": 93,
    "normalized_text": "The table contains the following information: 2.1 Cash and cash equivalents Particulars Cash on hand Balance with banks: In current account 2.2 Loans Particulars At amortised cost Loans repayable on demand - unsecured Loans to subsidiary Less: Impairement loss allowance Total Others - unsecured Less: Impairement loss allowance Total Total Loans Less: Impairement loss allowance Total Loans Out of the above Loans in India (i) Public Sector (ii) Others Total Less: Impairement loss allowance (Rs. In Lakhs) As at 31 March 2025 2024 0.71 5.06 4.91 2.34 5.62 7.40 (Rs. In Lakhs) As at 31 March 2025 2024 1,183.36 513.87 269.28 444.83 4.15 3.02 1,448.49 955.68 - - - - - - 1,452.64 958.70 4.15 3.02 1,448.49 955.68 - - 1,452.64 958.70 1,452.64 958.70 4.15 3.02 1,448.49 955.68."
  },
  {
    "element_id": 1386,
    "page_number": 93,
    "normalized_text": "The table contains the following information: Year ended 31 March 2025 Particulars Stage 1 Stage 2 Opening balance 958.70 - New disbursements 952.35 - Other movements including partial repayments and interst accruals (458.41) - Closing Balance 1,452.64 - Stage 3 Total - 958.70 - 952.35 - - 1,452.64."
  },
  {
    "element_id": 1409,
    "page_number": 93,
    "normalized_text": "The table contains the following information: Year ended 31 March 2025 Particulars Stage 1 Stage 2 Opening balance 3.02 - New disbursements & Other movements 1.13 - Closing Balance 4.15 - Stage 3 Total - 3.02 - 1.13 - 4.15."
  },
  {
    "element_id": 1410,
    "page_number": 93,
    "normalized_text": "The table contains the following information: Year ended 31 March 2024 Particulars Stage 1 Stage 2 Opening balance 4.73 0.98 New disbursements & Other movements (1.71) (0.98) Closing Balance 3.02 - Stage 3 Total - 5.71 - - 3.02."
  },
  {
    "element_id": 1420,
    "page_number": 94,
    "normalized_text": "The table contains the following information: 2.3 Investments Particulars Investments in equity instruments (Unquoted) Carried at cost (i) in subsidiary - Roddic Coffee Estates Private Limited Investments in Equity Instruments (Quoted) * Carried at Fair Value through Profit or Loss (FVTPL) Add: Fair value gains / (losses) Details of Investments in Equity Instruments No. of shares Aarti Pharmalabs Ltd 500.00 Alpex Solar Ltd 1,200.00 Canara Bank 1,000.00 Global Surface Ltd - HDFC Bank Ltd 10,450.00 HUDCO - IIL - JP Power - Jio Financial Services Ltd 11,000.00 Kay Cee Energy & Infra Ltd 2,000.00 Kitex Garments Ltd 6,000.00 Libas Consu Products Ltd 25,000.00 Marshall Machines Ltd 50,000.00 Mishra Dhatu Nigam Ltd - Nupur Recyclers Ltd 4,500.00 Oriental Trimex Ltd 9,09,000.00 P.E.Analytics Ltd - Rajnish Wellness Ltd 1,00,000.00 Rashtriya Chemical Fertilisers Ltd 8,000.00 Sanmit Infra Ltd. - Sadbhav Engineering Ltd 1,27,500.00 SEPC Ltd 34,732.00 Shriram Epc Ltd. - SJVN Ltd - Tata Elxsi Ltd 100.00 Tourism Finance Corp. Of - Vintage Coffee and Brevages Ltd 5,000.00 Veefin - VIP Industries Ltd 4,000.00 Vishnusurya Projects and Infra Ltd 2,000.00 Wockhardt Ltd 1,030.00 No. of shares - - - 1,500.00 8,250.00 1,000.00 1,000.00 50,000.00 10,000.00 2,000.00 - 25,000.00 50,000.00 6,000.00 - - 2,400.00 - 8,000.00 2,000.00 - - 34,732.00 4,000.00 - 12,000.00 - 1,600.00 12,000.00 - - (Rs. In Lakhs) As at 31 March 2025 2024 255.00 255.00 465.10 363.77 - 60.85 - 31.40 404.25 332.37 3.75 - 6.81 - 0.90 - - 3.46 191.09 119.48 - 1.87 - 3.40 - 7.64 25.02 35.38 3.25 3.54 10.80 - 2.68 4.68 5.39 12.00 - 23.63 2.70 - 82.82 - - 6.90 0.93 - 10.05 10.25 - 0.22 13.77 - 4.89 - - 5.79 - 4.86 5.23 - - 20.92 4.90 - - 4.91 11.20 63.46 3.40 - 14.67 - 404.25 332.37."
  },
  {
    "element_id": 1422,
    "page_number": 95,
    "normalized_text": "The table contains the following information: Investments in Mutual Funds (Quoted) Carried at Fair Value through Profit or Loss (FVTPL) Add: Fair value gains / (losses) Details of Investment in Mutual Fund ICICI Prudential VCF Real Estate Scheme - I Kotak Balance Advantage Fund Kotak Equity Arbitrage Fund (iii) In gold coins Add: Fair value gains / (losses) (iv) In Real Estate (Flat at Emarald, Kanpur) Add: Fair value gains / (losses) Total Out of the above In India Outside India 3.03 264.71 - 38.47 3.03 303.18 3.03 14.71 - 35.00 - 215.00 3.03 264.71 5.71 5.71 15.19 10.05 20.90 15.76 204.16 204.16 - - 204.16 204.16 887.33 1,110.46 887.33 1,110.46."
  },
  {
    "element_id": 1427,
    "page_number": 95,
    "normalized_text": "The table contains the following information: 2.4 Other financial assets Particulars TDS Receivable AY 2025-26 Security deposit Balance with Security Broker Staff & Other Advance (Rs. In Lakhs) As at 31 March 2025 2024 14.42 - 1.90 1.50 5.98 10.16 0.87 1.62."
  },
  {
    "element_id": 1434,
    "page_number": 95,
    "normalized_text": "The table contains the following information: Particulars Profit before tax Current tax expenses Prior Period Tax As at 31 March 2025 2024 208.28 154.67 58.34 40.00 (4.49) 6.14."
  },
  {
    "element_id": 1439,
    "page_number": 95,
    "normalized_text": "The table contains the following information: Particulars Deferred tax relates to the following: Deferred tax assets Depreciation and amortization Impairment of financial instruments Unrealised net loss on fair value changes Gross deferred tax assets Deferred tax liabilities Unrealised net gain on fair value changes Gross deferred tax liabilities Deferred tax assets/(liabilities), net As at 31 March 2025 2024 3.16 3.25 7.77 (0.68) - - 10.92 2.57 1.29 2.60 1.29 2.60 9.63 (0.03)."
  },
  {
    "element_id": 1441,
    "page_number": 96,
    "normalized_text": "The table contains the following information: Changes in deferred tax assets recorded in profit or loss As at 31 March Particulars 2025 2024 Deferred tax relates to the following: Deferred tax assets Depreciation and amortization (0.09) (1.07) Impairment of financial instruments 8.45 (0.68) Unrealised net loss on fair value changes - Unrealised net gain on fair value changes (1.31) 1.10."
  },
  {
    "element_id": 1445,
    "page_number": 96,
    "normalized_text": "The table contains the following information: As at 31 March Particulars 2025 2024 Fixed Deposits with Banks with maturity more than 12 Months 446.40 431.46 Total 446.40 431.46."
  },
  {
    "element_id": 1446,
    "page_number": 96,
    "normalized_text": "The table contains the following information: Total 446.40 431.46 2.8 Payables As at 31 March Particulars 2025 2024 (i) Trade payable - Total outstanding dues of micro enterprises and small enterprises - - Total outstanding dues creditots other than micro enterprises and small enterprises - 0.20 - 0.20 (ii) Other payable Total outstanding dues of micro enterprises and small enterprises - - Total outstanding dues creditots other than micro enterprises and small enterprises 16.49 1.80 16.49 1.80 Total 16.49 2.00."
  },
  {
    "element_id": 1451,
    "page_number": 96,
    "normalized_text": "The table contains the following information: Outstanding for following periods from due date of payments Less than 1 year 1-2 years 2-3 years More than 3 years Total Total outstanding dues of micro enterprises and small enterprises - - - - - Total outstanding dues of creditors other than micro enterprises and small enterprises 16.49 - - - 16.49 Disputed dues of micro enterprises and small enterprises - - - - - Disputed dues of creditors other than micro enterprises and small enterprises - - - - -."
  },
  {
    "element_id": 1453,
    "page_number": 96,
    "normalized_text": "The table contains the following information: Outstanding for following periods from due date of payments Less than 1 year 1-2 years 2-3 years More than 3 years Total Total outstanding dues of micro enterprises and small enterprises - - - - - Total outstanding dues of creditors other than micro enterprises and small enterprises 2.00 - - - 2.00 Disputed dues of micro enterprises and small enterprises - - - - - Disputed dues of creditors other than micro - - - - -."
  },
  {
    "element_id": 1455,
    "page_number": 96,
    "normalized_text": "The table contains the following information: 2.9 Borrowings (other than Debt Securities) ` in lakhs As at 31 March Particulars 2025 2024 Secured Loans Loans repayable on demand from Banks 164.71 127.39 Total."
  },
  {
    "element_id": 1459,
    "page_number": 96,
    "normalized_text": "The table contains the following information: 2.10 Current Tax Liabilities (Net) ` in lakhs As at 31 March Particulars 2025 2024 Provision for Income Tax 58.34 4.99 Total 58.34 4.99."
  },
  {
    "element_id": 1462,
    "page_number": 97,
    "normalized_text": "The table contains the following information: 2.11 Provisions ` in lakhs As at 31 March Particulars 2025 2024 Provisions retained for sale of non-performing assets as per RBI 5.81 3.83 Other Provisons (TDS) 0.17 - Total 5.98 3.83."
  },
  {
    "element_id": 1464,
    "page_number": 97,
    "normalized_text": "The table contains the following information: ` in lakhs As at 31 March Particulars 2025 2024 Authorized 11,00,00,000 (11,00,00,000) equity shares of Rs. 1/- each 1,100.00 1,100.00 Issued, subscribed and paid up 10,04,75,000 (10,04,75,000) equity shares of Rs. 1/- each 1,004.75 1,004.75."
  },
  {
    "element_id": 1467,
    "page_number": 97,
    "normalized_text": "The table contains the following information: Particulars Numbers ` in lakhs Equity share capital issued, subscribed and fully paid-up 10,04,75,000 1,004.75 Add: issued during the year - - As at 1 April 2023 10,04,75,000 1,004.75 As at 1 April 2023 10,04,75,000 1,004.75 Add: issued during the year - - As at 31 March 2024 10,04,75,000 1,004.75 As at 31 March 2025 10,04,75,000 1,004.75 Add: issued during the year - -."
  },
  {
    "element_id": 1473,
    "page_number": 97,
    "normalized_text": "The table contains the following information: As at As at Particulars 31-03-2025 31-03-2024 Nos. % Holding Nos. % Holding Ruchi Agarwal 5816000 6% 5816000 6% Sandhya Agarwal 5375000 5% 5375000 5% Total 11191000 11% 11191000 11%."
  },
  {
    "element_id": 1477,
    "page_number": 98,
    "normalized_text": "The table contains the following information: 2.13 Other equity ` in lakhs As at 31 March Particulars 2025 2024 (i) Securities premium Balance at the beginning of the year 980.00 980.00 Add: Received during the year - - Balance at the end of the year 980.00 980.00 (ii) Retained earnings Balance at the beginning of the year 573.48 488.93 Profit for the year 164.09 105.69 737.57 594.62 Appropriations: Transfer to reserve fund in terms of section 45-IC of the RBI Act, 1934 32.82 21.14 32.82 21.14 Balance at the end of the year 704.75 573.48 Other reserves (iii) Reserve fund in terms of section 45-IC of the RBI Act, 1934 Balance at the beginning of the year 128.04 106.90 Add: Received during the year 32.82 21.14 Balance at the end of the year 160.86 128.04 (iv) General reserve Balance at the beginning of the year 24.01 24.01 Addition/deduction during the year - - Balance at the end of the year 24.01 24.01 (v) Other comprehensive income Balance at the beginning of the year - - Addition/deduction during the year - - Balance at the end of the year - - Total other equity 1,869.62 1,705.53 Nature and purpose of other equity (i) Securities Premium Securities premium is used to record the premium on issue of shares. It can be utilised only for limited purposes in accordance with."
  },
  {
    "element_id": 1486,
    "page_number": 99,
    "normalized_text": "The table contains the following information: Notes to standalone financial statements for the year ended 31 March, 2025 3.1 Interest Income ` in lakhs For the year ended 31 March Particulars 2025 2024 On financial assets measured at amortized cost: Loans 128.29 116.34 Investments 31.88 12.66 Total 160.17 129.01 3.2 Net gain on fair value changes For the year ended 31 March Particulars 2025 2024 Realised - - Unrealised 5.14 12.68 Total 5.14 12.68 3.3 Other Income For the year ended 31 March Particulars 2025 2024 Profit on sale of securities and mutual funds etc 50.65 52.87 Dividend Income 2.47 0.65 Trading profit in F & O 46.45 27.63 Profit on sale of Land 16.51 - Total 116.08 81.15 3.4 Finance Cost For the year ended 31 March Particulars 2025 2024 Other interest expense 7.61 0.39 Total 7.61 0.39 3.5 Impairment on financial instruments measured at amortised cost For the year ended 31 March Particulars 2025 2024 Loans 1.13 (2.69) Investments 29.72 - Total 30.85 (2.69) The table below shows the ECL Charges on financial instruments for the yer recorded in the profit and loss based on evaluation stage: Year ended 31 March 2025 Particulars Stage 1 Stage 2 Stage 3 Loans 1.13 - - Investments 29.72 Total 30.85 - - The table below shows the ECL Charges on financial instruments for the yer recorded in the profit and loss based on evaluation stage: Year ended 31 March 2024 Particulars Stage 1 Stage 2 Stage 3 Loans (2.69) - -."
  },
  {
    "element_id": 1496,
    "page_number": 100,
    "normalized_text": "The table contains the following information: 3.6 Employee Benefits Expenses Particulars Salaries and wages Total 3.7 Other Expenses Particulars Advertisement Annual fees-Stock Exchange Bank Charges Communication expenses CDSL N NSDL Electricity Expenses Filing Fee Insurance SEBI Penalty Legal and professional fees Miscellaneous expenses Payment to auditors * Printing and stationery Provision for standard assets Repairs and maintenance Rent Loss on sale of Investment Travelling and conveyance Total Payment to Auditor For Income Tax Matters For Audit Matters For Other Matters Total 3.8 Other Comprehensive Income Particulars Items that will not be reclassified to Profit and Loss Equity Instrument through Other Comprehensive Income Less: Income Tax 3.9 Earning per Share Particulars Profit for the year as per Statement of Profit and Loss Weighted average number of Equity Shares in calculating Basic and Diluted EPS Basic earnings per share (in Rs) Diluted earnings per share (in Rs) ` in lakhs For the year ended 31 March 2025 2024 10.13 10.31 10.13 10.31 For the year ended 31 March 2025 2024 0.69 1.34 4.05 3.88 0.02 0.14 0.27 0.15 2.67 2.52 0.09 0.08 0.17 0.13 0.84 0.69 - 20.00 3.31 7.60 0.09 0.13 2.10 2.36 0.30 0.30 1.98 (1.47) 0.26 0.25 4.16 3.84 - 13.62 0.13 0.21 21.12 55.76 For the year ended 31 March 2025 2024 - - 2.10 2.36 - - 2.10 2.36 For the year ended 31 March 2025 2024 - - - - - - For the year ended 31 March 2025 2024 164.09 105.68 10,04,75,000.00 10,04,75,000.00 0.16 0.11 0.16 0.11."
  },
  {
    "element_id": 1498,
    "page_number": 101,
    "normalized_text": "The table contains the following information: Sulabh Engineers & Services Limited 2.6 Property, plant and equipment and intangible assets For the financial year 2024-25 Gross block 1 April Deduction /adjustments 2024 Additions Particulars Freehold Land 320.91 - 28.49 Vehicles 35.14 - - Furniture and fixtures 0.14 - - Computers 2.60 0.90 - Office equipments 4.77 - - Sub-total 363.57 0.90 28.49 Intangible assets (b) Softwares - - - Sub-total - - - Total 363.57 0.90 28.49 For the financial year 2023-24 Gross block 1 April 2023 Additions Deduction Particulars /adjustments Property, plant and equipment (a) Freehold Land 320.91 - - Vehicles 35.14 - - Furniture and fixtures 0.14 - - Computers 2.02 0.59 - Office equipments 4.77 - - Sub-total 362.98 0.59 - Intangible assets (b) Softwares - - - Sub-total - - - Total 362.98 0.59 - 31 March 2025 292.43 35.14 0.14 3.50 4.77 335.98 - - 335.98 31 March 2024 320.91 35.14 0.14 2.60 4.77 363.57 - - 363.57 1 April 2024 1 April 2023 - 28.09 0.13 2.25 2.86 33.33 - - 33.33 - 24.90 0.13 1.91 2.00 28.94 - - 28.94 Depreciation and amortization Deduction /adjustments For the year - - - 2.19 - 0.00 - 0.63 - 0.59 - 3.41 - - - - - 3.41 Depreciation and amortization Deduction For the year /adjustments - - - 3.19 - 0.00 - 0.34 - 0.86 - 4.39 - - - - - 4.39 31 March 2025 - 30.28 0.13 2.88 3.45 36.74 - - 36.74 31 March 2024 - 28.09 0.13 2.25 2.86 33.33 - - 33.33 - (Rs. In Lakhs) Net block 31 March 2025 292.43 4.86 0.00 0.63 1.33 299.25 - - 299.25 Net block 31 March 2024 320.91 7.05 0.00 0.36 1.92 330.25 - - 330.25."
  },
  {
    "element_id": 1502,
    "page_number": 102,
    "normalized_text": "The table contains the following information: 4.1 Contingent liabilities and commitments (Rs. In Lakhs) As at 31 March Particulars 2025 2024 (a) Contingent liabilities not provided; Nil Nil (b) Capital and other commitments Nil Nil 4.2 Estimated amount of contarcts to be executed As at 31 March Particulars 2025 2024 Estimated amount of contracts remaining to be executed on capital account and not provided for Nil Nil 4.3 Disclosure of transactions with related parties as required by Ind AS 24 2025 2024 Name of the realated party and nature of relationship Nature of transactions Transaction Outstanding Transaction Outstanding value amounts value amounts carried in carried in Balance Balance Sheet Sheet (A) Holding Company, subsidiaries and fellow subsidiaries 1. Venkatswamy Mining and Esates Private Limited Investments in equity shares - 255.00 - 255.00 (Subsidiary Company) Loans and advances 175.54 269.28 174.50 444.83 (B) Key managerial personnel and their relatives 1. Seema Mittal (Director, CFO) Remuneration 1.80 - 1.80 - 2. Rekha Kejriwal (Company Secretary) Remuneration - - 5.40 - 3. Amit Kumar Kanaujia (Company Secretary) Remuneration 5.18 - - - 4.4 Event after reporting date There have been no events after the reporting date that require adjustments/ disclosure in these financial statements 4.5 Corporate Social Responsibility Expenditure required to be incurred under Section 135 of the Companies Act, 2013 on Corporate Social Responsibility (CSR) activities are Rs. Nil (Previous Year Rs. Nil) 4.5 Segment Reporting The Company operates in a single reportable segment i.e financing, since the nature of the loans are exposed to similar resik and return profiles hence they are collectively opearting under a single segment. The Company operates in a single geographical segment i.e. domestic. 4.6 Financial Instruments- Accounting Classifications And Fair Value Measurements (Ind As 107) Classification Of Financial Assets And Liabilities : Particulars As at 31 March 2025 2024 Financial Assets at Amortized Cost Cash and cash equivalents 5.62 7.40 Loans 1,448.49 955.68 Investments 255.00 255.00 Other Financial assets 23.18 13.27 Financial Assets at Fair Value through profit and loss Investments 632.33 855.46 TOTAL 2,364.62 2,086.81 Financial Liabilities at Amortized Cost Payables 16.49 2.00 Borrowinngs 164.71 127.39 TOTAL 181.20 129.39."
  },
  {
    "element_id": 1530,
    "page_number": 103,
    "normalized_text": "The table contains the following information: Due from Due from 1 Due from 2 After 5 years less than 1 to 2 Years to 5 Years Particulars year Trade Payables 181.20 - - - Total 181.20 - - - Due from Due from 1 Due from 2 After 5 years less than 1 to 2 Years to 5 Years Particulars year Trade Payables 129.39 - - - Total - - - -."
  },
  {
    "element_id": 1543,
    "page_number": 104,
    "normalized_text": "The table contains the following information: The Company’s Debt Equity ratio is as below: Particulars As at 31 March 2025 2024 Total Debt - - Total Equity 2,874.37 2,710.28 Debt / Equity Ratio - -."
  },
  {
    "element_id": 1566,
    "page_number": 104,
    "normalized_text": "The table contains the following information: Asset Classification as per RBI Norms Asset Classification as per Ind AS 109 Gross Loss Net Provisions carrying Allowances carrying required as amount (provisions) amount per IRACP as per Ind as required norms AS 109 under Ind AS 109 1 2 3 4 5 (3-4) 6 Performing assets - Loans Standard Stage- 1 1,452.64 4.15 1,448.49 2.91 Stage- 2 - - - - Sub-Total 1,452.64 4.15 1,448.49 2.91 Non-performing assets - NPA Sub-standard Stage- 3 - - - - Doubtful - upto 1 year Stage- 3 - - - - 1 to 3 years Stage- 3 - - - - More than 3 years Stage- 3 - - - - Sub-Total for doubtful - - - - Loss Stage- 3 - - - - Sub-Total for NPA - - - - Others Stage- 1 - - - - Stage- 2 - - - - Stage- 3 - - - - Sub-Total - - - - Total Stage- 1 1,452.64 4.15 1,448.49 2.91 Stage- 2 - - - - Stage- 3 - - - - Total 1,452.64 4.15 1,448.49 2.91 Difference between Ind AS 109 provisions and IRACP norms 7 = (4-6) 1.25 - 1.25 - - - - - - - - - - - 1.25 - - 1.25."
  },
  {
    "element_id": 1583,
    "page_number": 105,
    "normalized_text": "The table contains the following information: Fair value measurement using Particulars Carrying Quoted prices Significant Significant Value in active observable unobservable markets inputs inputs (Level 1) (Level 2) (Level 3) Financial assets Investments 632.33 632.33 - - 632.33 632.33 - -."
  },
  {
    "element_id": 1585,
    "page_number": 105,
    "normalized_text": "The table contains the following information: Particulars Carrying Value Fair Value Financial Assets: Cash and Cash Equivalents 5.62 Loans 1,448.49 Investments in subsidiary 255.00 Other financial assets 23.18 Financial liabilities Other payables 16.49 Borrowings 164.71."
  },
  {
    "element_id": 1619,
    "page_number": 105,
    "normalized_text": "The table contains the following information: Value Fair Value Financial Assets: Cash and Cash Equivalents 7.40 7.40 Loans 955.68 955.68 Investments in subsidiary 255.00 255.00 Other financial assets 13.27 13.27 Financial liabilities Other payables 2.00 2.00 Borrowings 127.39 127.39."
  },
  {
    "element_id": 1634,
    "page_number": 106,
    "normalized_text": "The table contains the following information: Particulars As at 31 March 2025 2024 i. Loans and advances in the nature of loans to subsidiaries Roddic Coffee and Estates Private Limited 269.28 444.83 ii. Deposits Nil Nil iii. Guarantees Nil Nil 4.12 Additional Regularory Information a. Analytical Ratios Ratios Numerator Denominator As at 31 March 2025 2024 % Variance Current Ratio (in times) Current assets Current liabilities 13.05 16.13 -19% Debt Equity Ratio (in times) Debt Shareholders equity 0.06 0.05 15% Debt Service Coverage Ration (in times) Earnings for Debt service (Profit after tax + Debt service 4.57 0.00 NA Interest+ Lease Rentals) (Interest+Principal repayments) Return on equity Ratio (in %) Net profit for the year Average shareholders equity 0.06 0.04 46% Trade receivable turnover ratio Revenue from operations Average trade receivables 0.08 0.07 5% Trade payable turnover ratio Other expenses Average trade Payables 0.00 0.00 0% Net capital turnover ratio Revenue from operations Working capital (current 0.00 0.00 0% assets - current liablities) Net profit ratio (in %) Net profit for the year Revenue from operations 58.31% 16.72% 249% Return on capital employed (in %) Profit before tax and finance cost Capital employed (Net worth + 7.25% 5.71% 27% borrowings = lease liabilities) Return on invetsments (in %) Income generated from treasury investments Avearage invested funds in 16.04% 15.60% 3% treasury investments Reson for variance in Return on Equity, Return on Capital Employed and Net Profit Ratio is due to increase in Profits in the current year Analytical Ratios Particulars As at As at % Change Reasons for."
  },
  {
    "element_id": 1635,
    "page_number": 106,
    "normalized_text": "The table contains the following information: Analytical Ratios Particulars As at As at % Change 31.03.2025 31.03.2025 variance Capital to risk-weighted assets ratio (CRAR) NA NA NA Tier I CRAR NA NA NA Tier II CRAR NA NA NA Liquidity Coverage Ratio NA NA NA."
  },
  {
    "element_id": 1664,
    "page_number": 107,
    "normalized_text": "The table contains the following information: The Company have not advanced or loaned or invested funds to any other person(s) or entity(ies), including foreign entities (Intermediaries) with the n understanding that the Intermediary shall: a. directly or indirectly lend or invest in other persons or entities identified in any manner whatsoever by or on behalf of the company (Ultimate Beneficiaries), or b. provide any guarantee, security or the like to or on behalf of the Ultimate Beneficiaries The Company have not received any fund from any person(s) or entity(ies), including foreign entities (Funding Party) with the understanding (whether o recorded in writing or otherwise) that the Company shall: a. directly or indirectly lend or invest in other persons or entities identified in any manner whatsoever by or on behalf of the Funding Party (Ultimate Beneficiaries), or b. provide any guarantee, security or the like on behalf of the Ultimate Beneficiaries. The Company have not any such transaction which is not recorded in the books of accounts that has been surrendered or disclosed as income during the p year in the tax assessments under the Income Tax Act, 1961 (such as, search or survey or any other relevant provisions of the Income Tax Act, 1961. 4.14 The Company uses accounting softwares for maintaining its books of account which has a feature of recording audit trail (edit log) facility and the same has operated throughout the year for all relevant transactions recorded in the accounting software. Further, there is no instance of audit trail feature being tampered in respect of the accounting softwares. Additionally, the audit trail has been preserved by the Company as per the statutory requirements for record retention. 4.15 Previous year's figures have been regrouped/ rearranged wherever necessary to make them comparable to those with the current year. As per our report of even date For Ranjit Jain & Co. For and on behalf of Board of Directors Chartered Accountants FRN: 322505E sd/- sd/- Vimal Kumar Sharma Aman Preet Kaur CA Ashok Kumar Agarwal Managing Director Director Partner DIN: 00954083 DIN:09711954 Membership No. :056622 sd/- sd/- Chief Financial Officer Company Secretary Place: Mumbai Seema Mittal Amit Kumar Kanaujia Date: May 28, 2025 PAN: CCAPM1399E PAN: CNSPK8778G."
  },
  {
    "element_id": 1778,
    "page_number": 114,
    "normalized_text": "The table contains the following information: (d) Measurement of ECL."
  },
  {
    "element_id": 1796,
    "page_number": 114,
    "normalized_text": "The table contains the following information: (iii) Offsetting of financial instruments."
  },
  {
    "element_id": 1936,
    "page_number": 126,
    "normalized_text": "The table contains the following information: Sulabh Engineers & Services Limited Consolidated Balance Sheet Particulars Note No ASSETS 1) Financial Assets (a) Cash and Cash Equivalents 2.1 (b) Bank Balance other than (a) above (c) Receivables 2.2 (d) Loans 2.3 (e) Investments 2.4 (f) Other Financial Assets 2.5 2) Non-financial Assets (a) Deferred tax Assets (Net) 2.6 (b) Biological Assets other than bearer Plants 2.7 (b) Property, Plant and Equipment 2.8 (c) Other Non-Financial assets 2.9 Total Assets LIABILITIES AND EQUITY LIABILITIES 1) Financial Liabilities (a) Payables 2.10 (I) Other Payables (i) total outstanding dues of micro enterprises and small enterprises (ii) total outstanding dues of creditors other than micro and small enterprises (b) Borrowings (Other than debt securities) 2.11 2) Non-Financial Liabilities (a) Current tax liabilities (Net) 2.12 (b) Provisions 2.13 (c) Deferred tax liabilities (Net) 2.6 3) EQUITY (a) Equity Share capital 2.14 (b) Other Equity 2.15 Equity attributable towards the owner of the company Non- controlling interest Total Equity Total Liabilities and Equity Summary of significant accounting policies The accompanying notes are an integral part of the financial statements. As per our report of even date (Rs. In Lakhs) As at 31 March 2025 2024 12.97 13.37 - - 18.09 - 1,179.20 510.85 632.33 855.46 34.00 13.27 1,876.59 1,392.96 17.04 7.29 78.70 100.64 2,273.89 2,312.41 446.40 440.24 2,816.02 2,860.59 4,692.61 4,253.54 - - 23.60 5.32 164.71 127.39 188.31 132.71 58.34 4.99 10.07 3.83 1.29 2.60 69.70 11.42 1,004.75 1,004.75 2,588.26 2,295.54 3,593.01 3,300.29 841.58 809.11 4,434.59 4,109.41 4,692.61 4,253.54."
  },
  {
    "element_id": 1964,
    "page_number": 127,
    "normalized_text": "The table contains the following information: Sulabh Engineers & Services Limited Consolidated Statement of profit and loss Particulars Note No Revenue from operations Interest Income 3.1 Net gain on fair value changes 3.2 Sale of Products 3.3 Total Revenue from operations Other Income (to be specified) 3.4 Total Income Expenses Purchase of trading goods Finance Costs 3.5 Impairment on Financial Instruments 3.6 Changes in inventory of finished goods and stock in Trade 3.7 Employee Benefits Expenses 3.8 Depreciation, amortization and impairment 2.8 Others expenses 3.9 Total Expenses Profit/(loss) before tax Tax Expense: (1) Current Tax (2) Prior Period Tax (3) Deferred Tax Profit/(loss) for the year Other Comprehensive Income 3.10 (A) (i) Items that will not be reclassified to profit or loss (ii) Income tax relating to items that will not be reclassified to profit or loss (B) (i) Items that will be reclassified to profit or loss (ii) Income tax relating to items that will be reclassified to profit or loss Other Comprehensive Income for the year (net of tax) Total Comprehensive Income for the year Profit for the year attributable to Equity owners of the company Non-controlling interest Earnings per equity share (for continuing and discontinued operations) 3.11 Basic (Rs.) Diluted (Rs.) Summary of significant accounting policies The accompanying notes are an integral part of the financial statements. As per our report of even date For Ranjit Jain & Co. Chartered Accountants - (Rs. In Lakhs) For the year ended 31 March 2025 2024 160.17 129.01 5.14 12.68 327.64 173.82 492.95 315.50 117.09 81.64 610.05 397.14 - - 42.04 17.32 30.85 -2.69 21.94 -43.25 29.49 23.71 11.13 13.02 106.61 169.69 242.06 177.79 367.99 219.35 58.34 40.00 -4.49 3.26 -11.05 1.26 325.19 174.82 - - - - - - - - - - 325.19 174.82 246.25 142.36 78.94 32.47 325.19 174.82 0.32 0.17 0.32 0.17 For and on behalf of Board of Directors."
  },
  {
    "element_id": 1990,
    "page_number": 128,
    "normalized_text": "The table contains the following information: Sulabh Engineers & Services Limited Consolidated Statement of Cash Flow Particulars (A) CASH FLOW FROM OPERATING ACTIVITIES Net Profit before tax as per statement of Profit and loss Adjustments for : Depreciation & amortisation Investment fair value adjustment Impairment on Financial Instruments Others Operating profit before working capital changes Adjustment for: (Increase) /Decrease in Loans (Increase) /Decrease in Other financial and Non-Financial Assets (Increase) /Decrease in Investments (Decrease)/Increase in Other Financial and Non-Financial Liabilities Cash generated from operations Income Tax NET CASH FLOWS FROM OPERATING ACTIVITIES (B) CASH FLOW FROM INVESTING ACTIVITIES Payment for purchase and construction of property, plant and equipment Purchase of Property, Plant and Equipment including WIP, Investments etc Others NET CASH FLOWS FROM INVESTING ACTIVITIES ( C ) CASH FLOWS FROM FINANCING ACTIVITIES Borrowings NET CASH FLOWS FROM INVESTING ACTIVITIES Net increase / (decrease) in cash and cash equivalents Cash and cash equivalents at the beginning of the year Cash and cash equivalents at the end of the year As per our report of even date For Ranjit Jain & Co. Chartered Accountants FRN : 322505E CA Ashok Kumar Agarwal Partner Membership No. : 056622 Place: Kolkata Date: May 28, 2025 (Rs. In Lakhs) For the year ended 31 March 2025 2024 367.99 219.35 11.13 13.02 -5.14 -12.68 30.85 -2.69 1.98 - 406.80 216.99 -668.35 554.03 -23.03 -442.58 197.42 -563.87 75.89 125.93 -11.26 -109.50 -53.85 -43.26 -65.11 -152.76 27.38 -6.13 - 0.10 27.38 -6.03 37.33 -78.77 37.33 -78.77 -0.40 -237.55 13.37 250.93 12.97 13.37 For and on behalf of Board of Directors sd/- sd/- Vimal Kumar Sharma Aman Preet Kaur Managing Director Director DIN: 00954083 DIN: 09711954 sd/- sd/- Chief Financial Officer Company Secretary Seema Mittal Amit Kumar Kanaujia PAN: CCAPM1399E PAN: CNSPK8778G."
  },
  {
    "element_id": 1994,
    "page_number": 129,
    "normalized_text": "The table contains the following information: Equity share capital Particulars Balance at the beginning of the year Changes in equity share capital during the year Balance at the end of the year Other Equity For the year ended 31 March 2025 Particulars Secutities Premium Balance as at 31 March 2024 980.00 Profit after tax - Other comprehensive income (net of tax) - 980.00 Transfer to reserve fund in terms of - section 45-IC(1) of the Reserve Bank of India Act, 1934 Others - - Balance as at 31 March 2025 980.00 For the year ended 31 March 2024 Particulars Secutities Premium Balance as at 31 March 2023 980.00 Profit after tax - Other comprehensive income (net of tax) - 980.00 Transfer to reserve fund in terms of - section 45-IC(1) of the Reserve Bank of India Act, 1934 Others - - Balance as at 31 March 2024 980.00 Summary of significant accounting policies The accompanying notes are an integral part of the financial statements. As per our report of even date For Ranjit Jain & Co. Chartered Accountants FRN : 322505E CA Ashok Kumar Agarwal Partner Membership No. :056622 - Place: Kolkata Date: May 28, 2025 Reserves and surplus Retained Reserve fund earnings as per RBI Act 1,163.76 127.77 292.72 - - - 1,456.48 127.77 -32.82 32.82 - - -32.82 32.82 1,423.66 160.59 Reserves and surplus Retained Reserve fund earnings as per RBI Act 1,042.54 106.63 142.36 - - - 1,184.90 106.63 -21.14 21.14 - - -21.14 21.14 1,163.76 127.77 General reserve 24.01 - - 24.01 - - - 24.01 General reserve 24.01 - - 24.01 - - - 24.01 sd/- Vimal Kumar Sharma Managing Director DIN: 00954083 sd/- Chief Financial Officer Seema Mittal PAN: CCAPM1399E Rs in Lakhs For the year ended 31 March 2025 2024 1,004.75 1,004.75 - - 1,004.75 1,004.75 Rs in Lakhs Other Total other comprehensiv equity e income - 2,295.54 - 292.72 - - - 2,588.26 - - - - - - - 2,588.26 Other Total other comprehensiv equity e income - 2,153.18 - 142.36 - - - 2,295.54 - - - - - - - 2,295.54 For and on behalf of Board of Directors sd/- Aman Preet Kaur Director DIN: 09711954 sd/- Company Secretary Amit Kumar Kanaujia PAN: CNSPK8778G."
  },
  {
    "element_id": 1998,
    "page_number": 130,
    "normalized_text": "The table contains the following information: 2.1 Cash and cash equivalents Particulars Cash on hand Balance with banks: In current account (Rs. In Lakhs) As at 31 March 2025 2024 0.87 7.15 12.10 6.22 12.97 13.37."
  },
  {
    "element_id": 2011,
    "page_number": 130,
    "normalized_text": "The table contains the following information: Trade Receivables aging schedule as on 31st March, 2025 Outstanding for following periods from due date of payment Particulars Less than 6 months 6 month - 1 year 1-2 years i) Undisputed Trade 9.25 8.84 - Receivables - considered good ii) Undisputed Trade - - - Receivables - considered doubtful iii) Disputed Trade - - - Receivables - considered good iv) Disputed Trade - - - Receivables - considered doubtful Trade Receivables aging schedule as on 31st March, 2024 Outstanding for following periods from due date of payment Particulars Less than 6 months 6 month - 1 year 1-2 years i) Undisputed Trade - - - Receivables - considered good ii) Undisputed Trade - - - Receivables - considered doubtful iii) Disputed Trade - - - Receivables - considered good iv) Disputed Trade - - - Receivables - considered doubtful 2.3 Loans Particulars At amortised cost Loans repayable on demand - unsecured Loans to subsidiary Less: Impairement loss allowance Less: Mutual Owing Total Others - unsecured Less: Impairement loss allowance Total Total Loans Less: Impairement loss allowance Total Loans Out of the above Loans in India (i) Public Sector (ii) Others Total Less: Impairement loss allowance Total 2-3 year - 18.09 - - - - - - Total 2-3 year - - - - - - - - (Rs. In Lakhs) As at 31 March 2025 2024 1,183.36 513.87 269.28 444.83 1,452.64 958.70 4.15 3.02 269.28 444.83 1,179.20 510.85 - - - - - - 1,183.36 513.87 4.15 3.02 1,179.20 510.85 - - 1,183.36 513.87 1,183.36 513.87 4.15 3.02 1,179.20 510.85."
  },
  {
    "element_id": 2021,
    "page_number": 131,
    "normalized_text": "The table contains the following information: b) Analysis of change in the gross carrying amount of loans Year ended 31 March 2025 Particulars Stage 1 Stage 2 Stage 3 Opening balance 958.70 - - New disbursements 952.35 - - Assets derecognised - - - Other movements including partial repayments and interst accruals (458.41) - - Closing Balance 1,452.64 - - Year ended 31 March 2024 Particulars Stage 1 Stage 2 Stage 3 Opening balance 1,515.42 - - New disbursements 709.07 - - Assets derecognised - - - Other movements including partial repayments and interst accruals (1,265.79) - - Closing Balance 958.70 - - c) Reconciliation of ECL balance Year ended 31 March 2025 Particulars Stage 1 Stage 2 Stage 3 Opening balance 3.02 - - New disbursements & Other movements 1.13 # - - Assets derecognised - - - Closing Balance 4.15 - - Year ended 31 March 2024 Particulars Stage 1 Stage 2 Stage 3 Opening balance 4.73 0.98 - New disbursements & Other movements (1.71) # (0.98) - Assets derecognised - - - Closing Balance 3.02 - - Total 958.70 952.35 - (458.41) 1,452.64 Total 1,515.42 709.07 - (1,265.79) 958.70 Total 3.02 1.13 - 4.15 Total 5.71 (2.69) - 3.02."
  },
  {
    "element_id": 2023,
    "page_number": 131,
    "normalized_text": "The table contains the following information: 2.4 Investments (Rs. In Lakhs) As at 31 March Particulars 2025 2024 Investments in equity instruments (Unquoted) - - Carried at cost Investments in Equity Instruments (Quoted) Carried at Fair Value through Profit or Loss (FVTPL) 465.10 363.77 Add: Fair value gains / (losses) - 60.85 - 31.40."
  },
  {
    "element_id": 2027,
    "page_number": 132,
    "normalized_text": "The table contains the following information: Details of Investments in Equity Instruments Aarti Pharmalabs Ltd Alpex Solar Ltd Canara Bank Global Surface Ltd HDFC Bank Ltd HUDCO IIL JP Power Jio Financial Services Ltd Kay Cee Energy & Infra Ltd Kitex Garments Ltd Libas Consu Products Ltd Marshall Machines Ltd Mishra Dhatu Nigam Ltd Nupur Recyclers Ltd Oriental Trimex Ltd P.E.Analytics Ltd Rajnish Wellness Ltd Rashtriya Chemical Fertilisers Ltd Sanmit Infra Ltd. Sadbhav Engineering Ltd SEPC Ltd Shriram Epc Ltd. SJVN Ltd Tata Elxsi Ltd Tourism Finance Corp. Of Vintage Coffee and Brevages Ltd Veefin VIP Industries Ltd Vishnusurya Projects and Infra Ltd Wockhardt Ltd Investments in Mutual Funds (Quoted) Carried at Fair Value through Profit or Loss (FVTPL) Add: Fair value gains / (losses) Details of Investment in Mutual Fund ICICI Prudential VCF Real Estate Scheme - I Kotak Balance Advantage Fund Kotak Equity Arbitrage Fund (iii) In gold coins Add: Fair value gains / (losses) (iv) In Real Estate (Flat at Emarald, Kanpur) Add: Fair value gains / (losses) Total Out of the above In India Outside India Total No. of shares 500.00 1,200.00 1,000.00 - 10,450.00 - - - 11,000.00 2,000.00 6,000.00 25,000.00 50,000.00 - 4,500.00 9,09,000.00 - 1,00,000.00 8,000.00 - 1,27,500.00 34,732.00 - - 100.00 - 5,000.00 - 4,000.00 2,000.00 1,030.00 No. of shares - - - 1,500.00 8,250.00 1,000.00 1,000.00 50,000.00 10,000.00 2,000.00 - 25,000.00 50,000.00 6,000.00 - - 2,400.00 - 8,000.00 2,000.00 - - 34,732.00 4,000.00 - 12,000.00 - 1,600.00 12,000.00 - - 3.75 - 6.81 - 0.90 - - 3.46 191.09 119.48 - 1.87 - 3.40 - 7.64 25.02 35.38 3.25 3.54 10.80 - 2.68 4.68 5.39 12.00 - 23.63 2.70 - 82.82 - - 6.90 0.93 - 10.05 10.25 - 0.22 13.77 - 4.89 - - 5.79 - 4.86 5.23 - - 20.92 4.90 - - 4.91 11.20 63.46 3.40 - 14.67 - 404.25 332.37 3.03 264.71 - 38.47 3.03 303.18 3.03 14.71 - 35.00 - 215.00 3.03 264.71 5.71 5.71 15.19 10.05 20.90 15.76 204.16 204.16 - - 204.16 204.16 632.33 855.46 632.33 855.46 632.33 855.46."
  },
  {
    "element_id": 2029,
    "page_number": 132,
    "normalized_text": "The table contains the following information: Particulars TDS Receivable AY 2025-26 Security deposit Gst Recoverable Balance with Security Broker Advance to suppliers & others Total As at 31 March 2025 2024 14.42 - 1.95 1.50 4.23 5.98 10.16 7.42 1.62 34.00 13.27."
  },
  {
    "element_id": 2034,
    "page_number": 133,
    "normalized_text": "The table contains the following information: Particulars Profit before tax Current tax expenses Deferred Tax As at 31 March 2025 2024 367.99 219.35 58.34 40.00 (11.05) 1.26."
  },
  {
    "element_id": 2036,
    "page_number": 133,
    "normalized_text": "The table contains the following information: Particulars Deferred tax relates to the following: Deferred tax assets Depreciation and amortization Impairment of financial instruments Unrealised net loss on fair value changes Gross deferred tax assets Deferred tax liabilities Unrealised net gain on fair value changes Gross deferred tax liabilities Deferred tax assets/(liabilities), net As at 31 March 2025 2024 9.27 7.97 7.77 (0.68) - - 17.04 7.29 1.29 2.60 1.29 2.60 15.74 4.69."
  },
  {
    "element_id": 2038,
    "page_number": 133,
    "normalized_text": "The table contains the following information: Particulars Deferred tax relates to the following: Deferred tax assets Depreciation and amortization Impairment of financial instruments Unrealised net loss on fair value changes Unrealised net gain on fair value changes As at 31 March 2025 2024 1.30 0.52 8.45 (0.68) - - (1.31) 1.10 11.05 (1.26)."
  },
  {
    "element_id": 2041,
    "page_number": 133,
    "normalized_text": "The table contains the following information: Particulars Raw Material Work in Progress including Growing produce Finished Goods Stock in Trade Total 2.9 Other Non - Financial Assets Particulars Capital advances Fixed Deposits with Banks with maturity more than 12 Months Total As at 31 March 2025 2024 - - - 78.70 100.64 - 78.70 100.64 ` in lakhs As at 31 March 2025 2024 - - 446.40 440.24 446.40 440.24."
  },
  {
    "element_id": 2043,
    "page_number": 134,
    "normalized_text": "The table contains the following information: 2.10 Payables ` in lakhs As at 31 March Particulars 2025 2024 (i) Trade payable - Total outstanding dues of micro enterprises and small enterprises - - Total outstanding dues to creditors other than micro enterprises and small enterprises - 0.20 - 0.20 (ii) Other payable Total outstanding dues of micro enterprises and small enterprises - - Employee dues 1.49 0.89 Total outstanding dues creditors other than micro enterprises and small enterprises 22.11 4.23 23.60 5.12 Total 23.60 5.32."
  },
  {
    "element_id": 2044,
    "page_number": 134,
    "normalized_text": "The table contains the following information: Payables aging schedule as on 31st March, 2025 Less than 1 year Outstanding for following periods from due date of payments 1-2 years 2-3 years More than 3 years Total Total outstanding dues of - - - - - micro enterprises and small - enterprises Total outstanding dues of 23.60 - - - - 23.60 creditors other than micro enterprises and small enterprises Disputed dues of micro - - - - - enterprises and small - enterprises Disputed dues of creditors - - - - - other than micro enterprises and small enterprises -."
  },
  {
    "element_id": 2046,
    "page_number": 134,
    "normalized_text": "The table contains the following information: Less than 1 year Outstanding for following periods from due date of payments 1-2 years 2-3 years More than 3 years Total Total outstanding dues of - - - - - micro enterprises and small - enterprises Total outstanding dues of 5.32 - - - - 5.32 creditors other than micro enterprises and small enterprises Disputed dues of micro - - - - - enterprises and small - enterprises Disputed dues of creditors - - - - - other than micro enterprises and small enterprises -."
  },
  {
    "element_id": 2048,
    "page_number": 134,
    "normalized_text": "The table contains the following information: As at 31 March Particulars 2025 2024 Loans repayable on demand Unsecured Loans Unsecured Borrowing 434.00 572.21 From Directors - - From Parents Company 269.28 444.83 Secured Loans From Others from Banks 164.71 127.39 Total 434.00 572.21 Less: Mutual owing 269.28 444.83."
  },
  {
    "element_id": 2054,
    "page_number": 134,
    "normalized_text": "The table contains the following information: 2.12 Current Tax Liabilities (Net) ` in lakhs As at 31 March Particulars 2025 2024 Provision for Income Tax 58.34 4.99 Total 58.34 4.99."
  },
  {
    "element_id": 2056,
    "page_number": 135,
    "normalized_text": "The table contains the following information: 2.13 Provisions ` in lakhs As at 31 March Particulars 2025 2024 Provisions retained for sale of non-performing assets as per RBI 5.81 3.83 Other Provisons 4.26 - Total 10.07 3.83 2.14 Equity ` in lakhs As at 31 March Particulars 2025 2024 Authorized 11,00,00,000 (11,00,00,000) equity shares of Rs. 1/- each 1,100.00 1,100.00 Issued, subscribed and paid up 10,04,75,000 (10,04,75,000) equity shares of Rs. 1/- each 1,004.75 1,004.75 (a) Reconciliation of shares outstanding at the beginning and at the end of the year Particulars Numbers ` in lakhs Equity share capital issued, subscribed and fully paid-up 10,04,75,000 1,004.75 Add: issued during the year - - As at 1 April 2023 10,04,75,000 1,004.75 As at 1 April 2023 10,04,75,000 1,004.75 Add: issued during the year - - As at 31 March 2024 10,04,75,000 1,004.75 As at 31 March 2024 10,04,75,000 1,004.75 Add: issued during the year - - As at 31 March 2025 10,04,75,000 1,004.75."
  },
  {
    "element_id": 2060,
    "page_number": 135,
    "normalized_text": "The table contains the following information: As at As at Particulars 31-03-2025 31-03-2024 Nos. % Holding Nos. % Holding Ruchi Agarwal 5816000 6% 5816000 6% Sandhya Agarwal 5375000 5% 5375000 5% Total 11191000 11% 11191000 11%."
  },
  {
    "element_id": 2063,
    "page_number": 136,
    "normalized_text": "The table contains the following information: 2.15 Other Equity ` in lakhs As at 31 March Particulars 2025 2024 (i) Securities premium Balance at the beginning of the year 980.00 980.00 Add: Received during the year - - Balance at the end of the year 980.00 980.00 (ii) Retained earnings Balance at the beginning of the year 1,163.76 1,042.54 Profit for the year 292.72 142.36 1,456.48 1,184.90 Appropriations: Transfer to reserve fund in terms of section 45-IC of the RBI Act, 1934 32.82 21.14 32.82 21.14 Balance at the end of the year 1,423.66 1,163.76 Other reserves (iii) Reserve fund in terms of section 45-IC of the RBI Act, 1934 Balance at the beginning of the year 127.77 106.63 Add: Received during the year 32.82 21.14 Balance at the end of the year 160.59 127.77 (iv) General reserve Balance at the beginning of the year 24.01 24.01 Addition/deduction during the year - - Balance at the end of the year 24.01 24.01 (v) Other comprehensive income Balance at the beginning of the year - - Addition/deduction during the year - - Balance at the end of the year - - Total other equity 2,588.26 2,295.54 Nature and purpose of other equity (i) Securities Premium."
  },
  {
    "element_id": 2072,
    "page_number": 137,
    "normalized_text": "The table contains the following information: Notes to consolidated financial statements for the year ended 31 March, 2025 3.1 Interest Income ` in lakhs For the year ended 31 March Particulars 2025 2024 On financial assets measured at amortized cost: Loans 128.29 116.34 Investments 31.88 12.66 Debentures - - Total 160.17 129.01 3.2 Net gain on fair value changes ` in lakhs For the year ended 31 March Particulars 2025 2024 Realised - - Unrealised 5.14 12.68 Total 5.14 12.68 3.3 Sale of Products ` in lakhs For the year ended 31 March Particulars 2025 2024 Sale of Product 327.64 173.82 Total 327.64 173.82 3.4 Other Income ` in lakhs For the year ended 31 March Particulars 2025 2024 Profit on sale of securities and mutual funds etc 50.65 52.87 Dividend Income 2.47 0.65 Trading profit in F & O 46.45 27.63 Profit on sale of Land 16.51 - Miscellaneous income 1.01 0.49 Total 117.09 81.64 3.5 Finance Cost ` in lakhs For the year ended 31 March Particulars 2025 2024 Other interest expense 42.04 17.32 Total 42.04 17.32 3.6 Impairment on financial instruments measured at amortised cost ` in lakhs For the year ended 31 March Particulars 2025 2024 Loans 1.13 (2.69) Investments 29.72 - Total 30.85 (2.69) The table below shows the ECL Charges on financial instruments for the yer recorded in the profit and loss based on evaluation stage: ` in lakhs Year ended 31 March 2025 Particulars Stage 1 Stage 2 Stage 3."
  },
  {
    "element_id": 2073,
    "page_number": 137,
    "normalized_text": "The table contains the following information: Year ended 31 March 2025 Particulars Stage 1 Stage 2 Loans 1.13 - - Investments 29.72 - Total 30.85 - -."
  },
  {
    "element_id": 2079,
    "page_number": 137,
    "normalized_text": "The table contains the following information: Year ended 31 March 2024 Particulars Stage 1 Stage 2 Loans (2.69) - - Investments - - Total (2.69) - -."
  },
  {
    "element_id": 2082,
    "page_number": 138,
    "normalized_text": "The table contains the following information: 3.7 Changes in inventory of finished goods and Stock in Trade Particulars Closing Stock of Finished goods Closing Stock of Stock in Progress Less: Opening Stock of Finished Goods Opening Stock of work in progress (Increase)/Decrease in stock Notes to consolidated financial statements for the year ended 31 March, 2025 3.8 Employee Benefits Expenses Particulars Salaries and wages Contribution to provident fund Staff welfare expenses Total 3.9 Other Expenses Particulars Advertisement Agriculture expenses Annual fees-Stock Exchange Bank Charges Communication expenses CDSL N NSDL Power & fuel Electricity Expenses Freight Inwards Filing Fee Insurance Labour Contract Charges SEBI Penalty Legal and professional fees Miscellaneous expenses Mining Fees Payment to auditors * Postage & Courier Printing and stationery Provision for standard assets Repairs and maintenance Rent Loss on sale of Investment Travelling and conveyance Total Payment to Auditors ` in lakhs For the year ended 31 March 2025 2024 78.70 100.64 - - 78.70 100.64 100.64 57.40 - 100.64 57.40 21.94 (43.25) ` in lakhs For the year ended 31 March 2025 2024 26.72 21.60 0.31 0.38 2.46 1.73 29.49 23.71 ` in lakhs For the year ended 31 March 2025 2024 0.69 1.34 14.25 20.07 4.05 3.88 0.40 0.31 0.34 0.25 2.67 2.52 8.08 5.10 0.09 0.08 0.76 1.20 0.24 0.13 1.35 1.19 49.36 51.62 - 20.00 4.05 8.90 0.89 0.56 1.93 14.69 2.70 2.96 0.00 - 0.47 0.40 1.98 (1.47) 7.10 17.11 4.16 3.84 - 13.62 1.05 1.40 106.61 169.69."
  },
  {
    "element_id": 2083,
    "page_number": 138,
    "normalized_text": "The table contains the following information: Particulars For Income Tax Matters For Audit Matters For Other Matters Total For the year ended 31 March 2025 2024 - - 2.70 2.96 - - 2.70 2.96."
  },
  {
    "element_id": 2085,
    "page_number": 139,
    "normalized_text": "The table contains the following information: 3.10 Other Comprehensive Income Particulars Items that will not be reclassified to Profit and Loss Equity Instrument through Other Comprehensive Income Less: Income Tax 3.11 Earning per Share Particulars Profit for the year as per Statement of Profit and Loss Weighted average number of Equity Shares in calculating Basic and Diluted EPS Basic earnings per share (in Rs) Diluted earnings per share (in Rs) For the year ended 31 March 2025 2024 - - - - - - For the year ended 31 March 2025 2024 325.19 174.82 10,04,75,000.00 10,04,75,000.00 0.32 0.17 0.32 0.17."
  },
  {
    "element_id": 2088,
    "page_number": 140,
    "normalized_text": "The table contains the following information: 2.8 Property, Plant and Equipment and Intangible Assets For the Financial Year 2024-25 Gross block 1 April 31 March 2024 Additions Deduction 2025 Particulars /adjustments Freehold Land 2,248.64 - 28.49 2,220.15 Civil Structure 25.02 - 25.02 Buildings 53.70 - 53.70 Plant and Machinery 24.17 - 24.17 Vehicles 52.36 - - 52.36 Furniture and fixtures 11.06 - - 11.06 Computers 3.22 0.90 - 4.12 Office equipments 6.91 0.21 - 7.12 Sub-total 2,425.08 1.10 28.49 2,397.69 Intangible assets (b) Softwares - - - - Sub-total - - - - Total 2,425.08 1.10 28.49 2,397.69 For the Financial Year 2023-24 Gross block 1 April 31 March 2023 Additions Deduction 2024 Particulars /adjustments Property, plant and equipment (a) Freehold Land 2,248.64 - - 2,248.64 Civil Structure 25.02 25.02 Buildings 50.92 2.77 53.70 Plant and Machinery 23.96 0.21 24.17 Vehicles 51.06 1.30 - 52.36 Furniture and fixtures 11.06 - - 11.06 Computers 2.48 0.74 - 3.22 Office equipments 5.80 1.11 - 6.91 Sub-total 2,418.95 6.13 - 2,425.08 Intangible assets (b) Softwares - - - - Sub-total - - - - Total 2,418.95 6.13 - 2,425.08 1 April 2024 - 15.58 23.36 18.96 42.10 6.34 2.70 3.62 112.67 - - 112.67 1 April 2023 - 14.72 20.29 17.81 38.01 4.20 2.35 2.28 99.65 - - 99.65 Depreciation and amortization Deduction For the year /adjustments - - 0.79 2.79 0.94 - 3.14 - 1.46 - 0.72 - 1.29 - 11.13 - - - - - 11.13 Depreciation and amortization Deduction For the year /adjustments - - 0.87 3.07 1.16 - 4.09 - 2.14 - 0.35 - 1.34 - 13.02 - - - - - 13.02 31 March 2025 - 16.38 26.15 19.91 45.24 7.80 3.42 4.91 123.80 - - 123.80 31 March 2024 - 15.58 23.36 18.96 42.10 6.34 2.70 3.62 112.67 - - 112.67 (Rs. In Lakhs) Net block 31 March 2025 2,220.15 8.64 27.54 4.26 7.12 3.26 0.70 2.21 2,273.89 - - 2,273.89 Net block 31 March 2024 2,248.64 9.44 30.33 5.20 10.26 4.72 0.53 3.29 2,312.41 - - 2,312.41."
  },
  {
    "element_id": 2092,
    "page_number": 141,
    "normalized_text": "The table contains the following information: Notes to consolidated financial statements for the year ended 31 March, 2025 4.1 Contingent liabilities and commitments (Rs. In Lakhs) As at 31 March Particulars 2025 2024 (a) Contingent liabilities not provided; Nil Nil (b) Capital and other commitments Nil Nil 4.2 Estimated amount of contarcts to be executed As at 31 March Particulars 2025 2024 Estimated amount of contracts remaining to be executed on capital account and not provided for Nil Nil 4.3 Disclosure of transactions with related parties as required by Ind AS 24 2025 2024 Name of the realated party and nature of relationship Nature of transactions Transaction Outstanding Transaction value Outstanding value amounts amounts carried in carried in Balance Balance Sheet Sheet (A) Holding Company, subsidiaries and fellow subsidiaries 1. Venkatswamy Mining and Estates Private Limited Investments in equity shares - 255.00 - 255.00 (Subsidiary Company) Loans and advances 175.54 269.28 174.50 444.83 (B) Key managerial personnel and their relatives 1. Seema Mittal (Director, CFO) Remuneration 1.80 - 1.80 - 2. Rekha Kejriwal (Company Secretary) Remuneration 5.40 - 5.40 - 3. Amit Kumar Kanaujia (Company Secretary) Remuneration - - - - 4.4 Event after reporting date There have been no events after the reporting date that require adjustments/ disclosure in these financial statements 4.5 Corporate Social Responsibility Expenditure required to be incurred under Section 135 of the Companies Act, 2013 on Corporate Social Responsibility (CSR) activities are Rs. Nil (Previous Year Rs. Nil) 4.5 Segment Reporting The Company operates in a single reportable segment i.e financing, since the nature of the loans are exposed to similar resik and return profiles hence they are collectively opearting under a single segment. The Company operates in a single geographical segment i.e. domestic. 4.6 Financial Instruments- Accounting Classifications And Fair Value Measurements (Ind As 107) Classification Of Financial Assets And Liabilities : Particulars As at 31 March 2025 2024 Financial Assets at Amortized Cost Cash and cash equivalents 12.97 13.37 Loans 1,179.20 510.85 Investments 255.00 255.00 Other Financial assets 34.00 13.27 Financial Assets at Fair Value through profit and loss Investments 377.33 600.46 TOTAL 1,858.50 1,392.96 Financial Liabilities at Amortized Cost Payables 23.60 5.32 Borrowings 164.71 127.39 TOTAL 188.31 132.70."
  },
  {
    "element_id": 2098,
    "page_number": 142,
    "normalized_text": "The table contains the following information: monitored using, among other measures, the regulations issued by RBI. The Company has exposure to Credit, Liquidity and Market risks arising from financial instruments: a. Market Risk Market risk is the risk that the fair value of future cash flow of financial instruments will fluctuate due to changes in the market variables such as interest rates, foreign exchange rates and equity prices. The Company do not have any exposure to foreign exchange rate and equity price risk. b. Credit Risk Credit risk is the risk of financial loss arising out of a customer or counterparty failing to meet their repayment obligations to the Company. It has a diversified lending model and focuses on six broad categories viz: (i) consumer lending, (ii) SME lending, (iii) rural lending, (iv) mortgages, (v) loan against securities, and (vi) commercial lending. The Company assesses the credit quality of all financial instruments that are subject to credit risk. Classification of financial assets under various stages The Company classifies its financial assets in three stages having the following characteristics: Stage 1: unimpaired and without significant increase in credit risk since initial recognition on which a 12 month allowance for ECLis recognised; Stage 2: a significant increase in credit risk since initial recognition on which a lifetime ECLis recognised; Stage 3: objective evidence of impairment, and are therefore considered to be in default or otherwise credit impairedon which a lifetime ECLis recognised Unless identified atan earlier stage, all financial assets are deemed to have suffered a significant increase in credit risk when they are 30 days past due (DPD) and are accordingly transferred from stage 1 to stage 2. Forstage 1 an ECLallowance is calculated based on a 12 month Point in Time (PIT) probability weighted probability of default (PD). For stage 2 and 3 assets a life time ECLis calculated based on a lifetime PD. The Company has calculated ECL using three main components: a probability of default (PD), a loss given default (LGD) and the exposure at default (EAD) along with an adjustment considering forward macro economic conditions. Financial instruments other than loans were subjected to simplified ECL approach under Ind AS 109 ‘Financial Instruments' and accordingly were not subject to sensitivity of future economic conditions. The table below summarises the approach adopted by the Company for various components of ECL viz. PD, EAD and LGD across product lines using emperical data where relevant: c. Liquidity and interest rate Risk Liquidity risk is the risk that the Company will encounter difficulty in meeting the obligations associated with its financial liabilities that are settled by delivering cash or another financial asset. The Company's approach to managing liquidity is to ensure, as faras possible, that it will have sufficient liquidityto meetits liabilities when theyare due, under! both normal and stressed conditions, without incurring unacceptable losses orrisking damage to the Companys reputation. The following are the remaining contractual maturities of financial liabilities at the reporting date. The amounts are gross and undiscounted, and include estimated interest payments and exclude the impact of netting agreements. Interest rate risk is the risk that the fair value or furure cash flows of a financial instrument fluctuate because of change in marketinterest rates. The table below summarises the maturity profile of the undiscounted cashflow of the Company’s financial liabilities: Maturities of Financial Liabilities As at 31 March 2025 Due from Due from 1 to Due from 2 After 5 years Total less than 1 2 Years to 5 Years Particulars year Trade Payables 188.31 - 188.31."
  },
  {
    "element_id": 2099,
    "page_number": 142,
    "normalized_text": "The table contains the following information: As at 31 March 2025 Due from Due from 1 to Due from 2 After 5 years Total less than 1 2 Years to 5 Years Particulars year Trade Payables 188.31 - - - 188.31 Total 188.31 - - - 188.31 As at 31 March 2024 Due from Due from 1 to Due from 2 After 5 years Total less than 1 2 Years to 5 Years Particulars year Trade Payables 132.71 - - - 132.71 Total - - - - 132.71."
  },
  {
    "element_id": 2157,
    "page_number": 143,
    "normalized_text": "The table contains the following information: Asset Classification as per RBI Norms Asset Classification as per Ind AS 109 Gross Loss Net Provisions carrying Allowances carrying required as per amount as (provisions) amount IRACP norms per Ind AS as required 109 under Ind AS 109 1 2 3 4 5 (3-4) 6 Performing assets - Loans Standard Stage- 1 1,452.64 4.15 1,448.49 2.91 Stage- 2 - - - - Sub-Total 1,452.64 4.15 1,448.49 2.91 Non-performing assets - NPA Sub-standard Stage- 3 - - - - Doubtful - upto 1 year Stage- 3 - - - - 1 to 3 years Stage- 3 - - - - More than 3 years Stage- 3 - - - - Sub-Total for doubtful - - - - Loss Stage- 3 - - - - Sub-Total for NPA - - - - Others Stage- 1 - - - - Stage- 2 - - - - Stage- 3 - - - - Sub-Total - - - - Total Stage- 1 1,452.64 4.15 1,448.49 2.91 Stage- 2 - - - - Stage- 3 - - - - Total 1,452.64 4.15 1,448.49 2.91 Difference between Ind AS 109 provisions and IRACP norms 7 = (4-6) 1.25 - 1.25 - - - - - - - - - - - 1.25 - - 1.25."
  },
  {
    "element_id": 2176,
    "page_number": 144,
    "normalized_text": "The table contains the following information: Fair value measurement using Particulars Carrying Quoted prices Significant Significant Value in active observable unobservable markets inputs inputs (Level 1) (Level 2) (Level 3) Financial assets Investments 632.33 632.33 - - 632.33 632.33 - -."
  },
  {
    "element_id": 2194,
    "page_number": 144,
    "normalized_text": "The table contains the following information: Fair value measurement using Particulars Carrying Quoted prices Significant Significant Value in active observable unobservable markets inputs inputs (Level 1) (Level 2) (Level 3) Financial assets Investments 855.46 855.46 - 855.46 855.46 - -."
  },
  {
    "element_id": 2231,
    "page_number": 145,
    "normalized_text": "The table contains the following information: Particulars As at 31 March 2025 i. Loans and advances in the nature of loans to subsidiaries Venkatswamy Mining and Estates Private Limited 269.28 ii. Deposits Nil iii. Guarantees Nil."
  },
  {
    "element_id": 2252,
    "page_number": 145,
    "normalized_text": "The table contains the following information: Debt Service Coverage Ration (in times) Earnings for Debt service (Profit after tax + Debt service (Interest+Principal 4.63 1.73 167.46% Interest+Lease Rentals) repayments) Return on equity Ratio (in %) Net profit for the year Average shareholders equity 0.07 0.04 83.32% Trade receivable turnover ratio Revenue from operations Average trade receivables 0.29 0.25 16.63% Trade payable turnover ratio Other expenses Average trade Payables - - - Net capital turnover ratio Revenue from operations Working capital (current assets - - - - current liablities) Net profit ratio (in %) Net profit for the year Revenue from operations 53.31% 55.41% -3.80% Return on capital employed (in %) Profit before tax and finance cost Capital employed (Net worth + 8.30% 5.34% 55.46% borrowings = lease liabilities) Return on invetsments (in %) Income generated from treasury investments Avearage invested funds in 0.22 0.23 -4.53% treasury investments Reason for variance is due to increase in Net Profit b. Analytical Ratios Particulars As at As at % Change Reasons for 31.03.2025 31.03.2025 variance Capital to risk-weighted assets ratio (CRAR) NA NA NA Tier I CRAR NA NA NA Tier II CRAR NA NA NA Liquidity Coverage Ratio NA NA NA c. The title deed of Immovable Property held by the company is in its own name. d. The group has not revalued its Property, Plant and Equipment during the year. e. The group has not granted Loans or Advances in the nature of Loans to Promoters, directors, KMPs and the related parties. f. The group do not have any Benami property, where any proceeding has been initiated or pending against the Company for holding any Benami property. g. The group do not have any borrowings from banks or financial institutions and has not been declared a wilful defaulter. The group has not made any investment beyond the number of layers prescribed under clause 87 of section 2 of the Companie Act, 2013 read with the h. Companies (Restriction on number of Layers) Rules, 2017. i. The provisions contained in Section 135 of the Companies Act, 2013 relating to CSR Activities are not applicable to the company for the year under review. j. The group do not have any transactions with struck off companies. k. The group do not have any charges or satisfaction which is yet to be registered with ROC beyond the statutory period. l. The group have not traded or invested in Crypto currency or Virtual Currency during the financial year. The group have not advanced or loaned or invested funds to any other person(s) or entity(ies), including foreign entities (Intermediaries) with the m. understanding that the Intermediary shall: a. directly or indirectly lend or invest in other persons or entities identified in any manner whatsoever by or on behalf of the company (Ultimate Beneficiaries), or b. provide any guarantee, security or the like to or on behalf of the Ultimate Beneficiaries n. The group have not received any fund from any person(s) or entity(ies), including foreign entities (Funding Party) with the understanding (whether recorded in writing or otherwise) that the Company shall: a. directly or indirectly lend or invest in other persons or entities identified in any manner whatsoever by or on behalf of the Funding Party (Ultimate Beneficiaries), or b. provide any guarantee, security or the like on behalf of the Ultimate Beneficiaries. The group have not any such transaction which is not recorded in the books of accounts that has been surrendered or disclosed as income during the year in o. the tax assessments under the Income Tax Act, 1961 (such as, search or survey or any other relevant provisions of the Income Tax Act, 1961.."
  },
  {
    "element_id": 2261,
    "page_number": 146,
    "normalized_text": "The table contains the following information: 4.13 (a) Interest in other subsidiary Name of the subsidiary Place of business Ownnership interest held Ownership interest held by non controlling interest by group (in %) (in %) As at 31st As at 31st As at 31st As at 31st March, 2025 March, 2024 March, 2025 March, 2024 Venkaswamy Mining and Estates Private Limited India 51.00 51.00 49.00 49.00 4.13 (b)Additional Information, as required under schedule-III to the Companies Act,2013, of enterprises consolidated as subsidiary Net Assets i.e. Total Assets Minus Total Liabilities Share of profit or loss Name of As % of Consolidated Net As % of Consolidated Profit/ Sl No. Subsidiary Assets Amount Loss Amount 1 Parent Sulabh Engineers and Services Ltd 80.00 2,874.37 50.46 164.09 2 Subsidiary Venkatswamy Mining and Estates Private Limited 50.52 1,815.23 49.54 161.10 Minority Interest 3 in Subsidiary 23.42 841.58 24.27 78.94."
  },
  {
    "element_id": 2264,
    "page_number": 146,
    "normalized_text": "The table contains the following information: As per our report of even date For Ranjit Jain & Co. For and on behalf of Board of Directors Chartered Accountants FRN : 322505E sd/- sd/- Vimal Kumar Sharma Aman Preet Kaur CA Ashok Kumar Agarwal Managing Director Director Partner DIN: 00954083 DIN: 09711954 Membership No. : 056622 sd/- - Chief Financial Officer sd/- Place: Kolkata Seema Mittal Amit Kumar Kanaujia Date: May 28, 2025 PAN: CCAPM1399E PAN: CNSPK8778G."
  },
  {
    "element_id": 2266,
    "page_number": 147,
    "normalized_text": "The table contains the following information: 1. Notes to consolidated financial statements for the year ended 31 March 2025 1.1 Corporate information Sulabh Engineers and Services Limited (\"the Company\") is a company limited by shares, incorporated on 27April 1983 and domiciled in India. These consolidated financial statements comprise the Company and its subsidiary (referred to collectively as the 'Group') and the 'Group's interest in associates. The Group is engaged in the business of lending and agricultural activities. 1.2 Basis of consolidation The consolidated financial statements have been prepared in accordance with Indian Accounting Standards (Ind AS) as prescribed in the Companies (Indian Accounting Standards) Rules, 2015 as amended from time to time and notified under section 133 of the Companies Act, 2013 (the Act) The group combines the financial statementsof the Company and its subsidiaries line by line adding together like items of assets, liabilities, equity, income and expenses. Intercompany transactions, balances and unrealized gains on transactions between group companies are eliminated. Unrealized losses are also eliminated unless the transaction provides evidence of an impairment of the transferred asset. Accounting policies have been applied uniformly across the group for like transactions and other events in similar circumstances. The excess of cost to the Company of its investment in the subsidiaries over the Company’s portion of equity of the subsidiaries or vice versa is recognized in the consolidated financial statements as goodwill or capital reserve as the case may be. The financial statements of all entities used for the purpose of consolidation are drawn up to same reporting date as that of the Company, i.e., year ended as on March 31. The excess of cost to the Company of its investment in the subsidiaries over the Company’s portion of equity of the subsidiaries or vice versa is recognized in the consolidated financial statements as goodwill or capital reserve as the case may be. Non-controlling interests (if any), in the results and equity of subsidiaries are shown separately in the consolidated statement of profit and loss, consolidated balance sheet, and consolidated statement of changes in equity respectively. 1.2.1 Presentation of financial statements The Company presents its Balance Sheet in order of liquidity. The Company generally reports financial assets and financial liabilities on a gross basis in the Balance Sheet. They are offset and reported net only when Ind AS specifically permits the same or it has an unconditional legally enforceable right to offset the recognised amounts without being contingent on a future event. Similarly, the Company offsets incomes and expenses and reports the same on a net basis when permitted by Ind AS specifically unless they are material in nature. Critical accounting estimates and judgments The preparation of the Company's financial statements requires Management to make use of estimates and judgments. In view of the inherent uncertainties and a level of subjectivity involved in measurement of items, it is possible that the outcomes in the subsequent financial years could differ from those on which the Management's estimates are based. Accounting estimates and judgments are used in various line items in the financial statements for e.g.: • Fair value of financial instruments [Refer note no. 1.3.11, 4.10] • Effective Interest Rate (EIR) [Refer note no. 1.3.1(i)] • Impairment on financial assets [Refer note no. 1.3.4(i)] • Provisions and other contingent liabilities [Refer note no. 1.3.10 and 4.1] • Provision for tax expenses [Refer note no. 1.3.6(i)] • Residual value and useful life of property, plant and equipment [Refer note no. 1.3.7] 1.3 Summary of significant accounting policies This note provides a list of the significant accounting policies adopted in the preparation of these financial statements. These policies have been consistently applied to all the years presented, unless otherwise stated. 1.3.1 Income (i) Interest income The Company recognizes interest income using Effective Interest Rate (EIR) on all financial assets subsequently measured at amortized cost or fair value through other comprehensive income (FVOCI). EIR is calculated by considering all costs and incomes attributable to acquisition of a financial asset or assumption of a financial liability and it represents a rate that exactly discounts estimated future cash payments/receipts through the expected life of the financial asset/financial liability to the gross carrying amount of a financial asset or to the amortized cost of a financial liability. The Company recognizes interest income by applying the EIR to the gross carrying amount of financial assets other than credit-impaired assets. In case of credit-impaired financial assets [as set out in note no. 1.3.4(i)] regarded as 'stage 3', the Company recognizes interest income on the amortized cost net of impairment loss of the financial asset at EIR. If the financial asset is no longer credit-impaired [as outlined in note no. 1.3.4(i)], the Company reverts to calculating interest income on a gross basis. Delayed payment interest (penal interest) levied on customers for delay in repayments/non-payment of contractual cash flows is recognized on realization. (ii) Dividend income Dividend income on equity shares is recognized when the Company's right to receive the payment is established, which is generally when shareholders approve the dividend.."
  },
  {
    "element_id": 2268,
    "page_number": 148,
    "normalized_text": "The table contains the following information: (iii) Other revenue from operations (a) Fees and commission The Company recognizes service and administration charges towards rendering of additional services to its loan customers on satisfactory completion of service delivery. Fees on value added services and products are recognized on rendering of services and products to the customer. Foreclosure charges are collected from loan customers for early payment/closure of loan and are recognized on realization. (b) Net gain on fair value changes Financial assets are subsequently measured at fair value through profit or loss (FVTPL) or fair value through other comprehensive income (FVOCI), as applicable. The Company recognizes gains/losses on fair value change of financial assets measured as FVTPL and realized gains/losses on derecognition of financial asset measured at FVTPL and FVOCI. (c) Sale of services The Company, on de-recognition of financial assets where a right to service the derecognized financial assets for a fee is retained, recognizes the fair value of future service fee income over service obligations cost on net basis as service fee income in the statement of profit or loss and, correspondingly creates a service asset in Balance Sheet. Any subsequent increase in the fair value of service assets is recognized as service income and any decrease is recognized as an expense in the period in which it occurs. The embedded interest component in the service asset is recognized as interest income in line with Ind AS 109 'Financial instruments'. (d) Recoveries of financial assets written off The Company recognizes income on recoveries of financial assets written off on realization or when the right to receive the same without any uncertainties of recovery is established. (iv) Taxes Incomes are recognized net of the Goods and Services Tax/Service Tax, wherever applicable. 1.3.2 Expenditures (i) Finance costs Borrowing costs on financial liabilities are recognized using the EIR [refer note no. 3.1(i)]. (ii) Fees and commission expenses Fees and commission expenses which are not directly linked to the sourcing of financial assets, such as commission/incentive incurred on value added services and products distribution, recovery charges and fees payable for management of portfolio etc., are recognized in the Statement of Profit and Loss on an accrual basis. (iii) Taxes Expenses are recognized net of the Goods and Services Tax/Service Tax, except where credit for the input tax is not statutorily permitted. 1.3.3 Cash and cash equivalents Cash and cash equivalents include cash on hand, other short term, highly liquid investments with original maturities of three months or less that are readily convertible to known amounts of cash and which are subject to an insignificant risk of changes in value. 1.3.4 Financial instruments A financial instrument is defined as any contract that gives rise to a financial asset of one entity and a financial liability or equity instrument of another entity. Trade receivables and payables, loan receivables, investments in securities and subsidiaries, debt securities and other borrowings, preferential and equity capital etc. are some examples of financial instruments. All the financial instruments are recognized on the date when the Company becomes party to the contractual provisions of the financial instruments. For tradable securities, the Company recognizes the financial instruments on settlement date. (i) Financial assets Financial assets include cash, or an equity instrument of another entity, or a contractual right to receive cash or another financial asset from another entity. Few examples of financial assets are loan receivables, investment in equity and debt instruments, trade receivables and cash and cash equivalents. Initial measurement All financial assets are recognized initially at fair value including transaction costs that are attributable to the acquisition of financial assets except in the case of financial assets recorded at FVTPL where the transaction costs are charged to profit or loss. Subsequent measurement For the purpose of subsequent measurement, financial assets are classified into four categories: a. Debt instruments at amortized cost b. Debt instruments at FVOCI c. Debt instruments at FVTPL d. Equity instruments designated at FVOCI."
  },
  {
    "element_id": 2271,
    "page_number": 149,
    "normalized_text": "The table contains the following information: The Company measures its financial assets at amortized cost if both the following conditions are met: • The asset is held within a business model of collecting contractual cash flows; and • Contractual terms of the asset give rise on specified dates to cash flows that are Sole Payments of Principal and Interest (SPPI) on the principal amount outstanding. To make the SPPI assessment, the Company applies judgment and considers relevant factors such as the nature of portfolio and the period for which the interest rate is set. The Company determines its business model at the level that best reflects how it manages groups of financial assets to achieve its business objective. The Company's business model is not assessed on an instrument by instrument basis, but at a higher level of aggregated portfolios. If cash flows after initial recognition are realized in a way that is different from the Company's original expectations, the Company does not change the classification of the remaining financial assets held in that business model, but incorporates such information when assessing newly originated financial assets going forward. The business model of the Company for assets subsequently measured at amortized cost category is to hold and collect contractual cash flows. However, considering the economic viability of carrying the delinquent portfolios in the books of the Company, it may sell these portfolios to banks and/or asset reconstruction companies. After initial measurement, such financial assets are subsequently measured at amortized cost on effective interest rate (EIR). For further details, refer note no. 3.1(i). The expected credit loss (ECL) calculation for debt instruments at amortized cost is explained in subsequent notes in this section. (b) Debt instruments at FVOCI The Company subsequently classifies its financial assets as FVOCI, only if both of the following criteria are met: • The objective of the business model is achieved both by collecting contractual cash flows and selling the financial assets; and • Contractual terms of the asset give rise on specified dates to cash flows that are Solely Payments of Principal and Interest (SPPI) on the principal amount outstanding. Debt instruments included within the FVOCI category are measured at each reporting date at fair value withsuch changes being recognized in other comprehensive income (OCI). The interest income on these assets isrecognized in profit or loss. The ECL calculation for debt instruments at FVOCI is explained in subsequent notesin this section. Debt instruments such as long term investments in Government securities to meet regulatory liquid assetrequirement of the Company's deposit program and mortgage loans portfolio where the Company periodicallyresorts to partially selling the loans by way of assignment to willing buyers are classified as FVOCI. On derecognition of the asset, cumulative gain or loss previously recognized in OCI is reclassified to profit or loss. (c) Debt instruments at FVTPL The Company classifies financial assets which are held for trading under FVTPL category. Held for trading assetsare recorded and measured in the Balance Sheet at fair value. Interest and dividend incomes are recorded ininterest income and dividend income, respectively according to the terms of the contract, or when the rightto receive the same has been established. Gain and losses on changes in fair value of debt instruments arerecognized on net basis through profit or loss. The Company's investments into mutual funds, Government securities (trading portfolio) and certificate ofdeposits for trading and short term cash flow management have been classified under this category. (d) Equity investments designated under FVOCI All equity investments in scope of Ind AS 109 'Financial Instruments' are measured at fair value. The Company has strategic investments in equity for which it has elected to present subsequent changes in the fair value inother comprehensive income. The classification is made on initial recognition and is irrevocable. All fair value changes of the equity instruments, excluding dividends, are recognized in OCI and not availablefor reclassification to profit or loss, even on sale of investments. Equity instruments at FVOCI are not subjectto an impairment assessment.."
  },
  {
    "element_id": 2298,
    "page_number": 151,
    "normalized_text": "The table contains the following information: (d) Measurement of ECL The assessment of credit risk and estimation of ECL are unbiased and probability weighted. It incorporates all information that is relevant including information about past events, current conditions and reasonable forecasts of future events and economic conditions at the reporting date. In addition, the estimation of ECL takes into account the time value of money. Forward looking economic scenarios determined with reference to external forecasts of economic parameters that have demonstrated a linkage to the performance of our portfolios over a period of time have been applied to determine impact of macroeconomic factors. The Company has calculated ECL using three main components: a probability of default (PD), a loss given default (LGD) and the exposure at default (EAD). ECL is calculated by multiplying the PD, LGD and EAD and adjusted for time value of money using a rate which is a reasonable approximation of EIR. • Determination of PD is covered above for each stages of ECL. • EAD represents the expected balance at default, taking into account the repayment of principal and interest from the Balance Sheet date to the date of default together with any expected drawdown ofcommitted facilities. • LGD represents expected losses on the EAD given the event of default, taking into account, among other attributes, the mitigating effect of collateral value at the time it is expected to be realized and the time value of money. A more detailed description of the methodology used for ECL is covered in the 'credit risk' section of note no. 4.7. (ii) Financial liabilities Financial liabilities include liabilities that represent a contractual obligation to deliver cash or another financial assetsto another entity, or a contract that may or will be settled in the entities own equity instruments. Few examples offinancial liabilities are trade payables, debt securities and other borrowings and subordinated debts. Initial measurement All financial liabilities are recognized initially at fair value and, in the case of borrowings and payables, net ofdirectly attributable transaction costs. The Company's financial liabilities include trade payables, other payables.debt securities and other borrowings. Subsequent measurement After initial recognition, all financial liabilities are subsequently measured at amortized cost using the EIR [Refer note no. 1.3.1(i)]. Any gains or losses arising on derecognition of liabilities are recognized in the Statement of Profit and Loss. De-recognition The Company derecognizes a financial liability when the obligation under the liability is discharged, cancelled or expired. (iii) Offsetting of financial instruments Financial assets and financial liabilities are offset and the net amount is reported in the Balance Sheet only if there is an enforceable legal right to offset the recognized amounts with an intention to settle on a net basis or to realize the assets and settle the liabilities simultaneously. 1.3.5 Investment in subsidiaries Investment in subsidiaries is recognized at cost and is not adjusted to fair value at the end of each reporting period. Cost of investment represents amount paid for acquisition of the said investment. The Company assesses at the end of each reporting period, if there are any indications that the said investment may be impaired. If so, the Company estimates the recoverable value/amount of the investment and provides for impairment, if any i.e. the deficit in the recoverable value over cost. 1.3.6 Taxes (i) Current tax Current tax assets and liabilities are measured at the amount expected to be recovered from or paid to the taxation authorities, in accordance with the Income Tax Act, 1961 and the Income Computation and Disclosure Standards (ICDS) prescribed therein. The tax rates and tax laws used to compute the amount are those that are enacted or substantively enacted, at the reporting date. Current tax relating to items recognized outside profit or loss is recognized in correlation to the underlying transaction either in OCI or directly in other equity. Management periodically evaluates positions taken in the tax returns with respect to situations in which applicable tax regulations are subject to interpretation and establishes provisions where appropriate.."
  },
  {
    "element_id": 2300,
    "page_number": 152,
    "normalized_text": "The table contains the following information: (ii) Deferred tax Deferred tax is provided using the Balance Sheet approach on temporary differences between the tax bases of assets and liabilities and their carrying amounts for financial reporting purposes at the reporting date. Deferred tax liabilities are recognized for all taxable temporary differences and deferred tax assets are recognized for deductible temporary differences to the extent that it is probable that taxable profits will be available against which the deductible temporary differences can be utilized. The carrying amount of deferred tax assets is reviewed at each reporting date and reduced to the extent that it is no longer probable that sufficient taxable profit will be available to allow all or part of the deferred tax asset to be utilized. Unrecognized deferred tax assets, if any, are reassessed at each reporting date and are recognized to the extent that it has become probable that future taxable profits will allow the deferred tax asset to be recovered. Deferred tax assets and liabilities are measured at the tax rates that are expected to apply in the year when the asset is realized or the liability is settled, based on tax rates (and tax laws) that have been enacted or substantively enacted at the reporting date. Deferred tax relating to items recognized outside profit or loss is recognized either in OCI or in other equity. Deferred tax assets and deferred tax liabilities are offset if a legally enforceable right exists to set off current tax assets against current tax liabilities and the deferred taxes relate to the same taxable entity and the same taxation authority. 1.3.7 Property, plant and equipment Property, plant and equipment are carried at historical cost of acquisition less accumulated depreciation and impairment losses, consistent with the criteria specified in Ind AS 16 'Property, Plant and Equipment'. Depreciation on property, plant and equipment Depreciation on property, plant & equipment has been provided on straight line method based on the useful life specified in Schedule II of the Companies Act, 2013 except where management estimate of useful life is different. Depreciation commences when the assets are ready for their intended use. Assets costing Rs. 5,000/- or less have been depreciated over period of one year. 1.3.8 Intangible assets and amortization thereof Intangible assets, representing software are initially recognized at cost and subsequently carried at cost less accumulated amortization and accumulated impairment. The intangible assets are amortized using the straight line method over a period of five years, which is the Management's estimate of its useful life. The useful lives of intangible assets are reviewed at each financial year end and adjusted prospectively, if appropriate. An asset's carrying amount is written down immediately to its recoverable amount if the asset's carrying amount is greater than its estimated recoverable amount. Gains and losses on disposals are determined by comparing proceeds with carrying amount. These are included in profit or loss within other income or other expenses, as applicable. 1.3.9 Impairment of non-financial assets An assessment is done at each Balance Sheet date to ascertain whether there is any indication that an asset may be impaired. If any such indication exists, an estimate of the recoverable amount of asset is determined. If the carrying value of relevant asset is higher than the recoverable amount, the carrying value is written down accordingly. 1.3.10 Provisions and contingent liabilities The Company creates a provision when there is present obligation as a result of a past event that probably requires an outflow of resources and a reliable estimate can be made of the amount of the obligation. A disclosure for a contingent liability is made when there is a possible obligation or a present obligation that may, but probably will not, require an outflow of resources. The Company also discloses present obligations for which a reliable estimate cannot be."
  },
  {
    "element_id": 2305,
    "page_number": 153,
    "normalized_text": "The table contains the following information: The Company measures its qualifying financial instruments at fair value on each Balance Sheet date. Fair value is the price that would be received against sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The fair value measurement is based on the presumption that the transaction to sell the asset or transfer the liability takes place in the accessible principal market or the most advantageous accessible market as applicable. The Company uses valuation techniques that are appropriate in the circumstances and for which sufficient data is available to measure fair value, maximizing the use of relevant observable inputs and minimizing the use of unobservable inputs. All assets and liabilities for which fair value is measured or disclosed in the financial statements are categorized within the fair value hierarchy into Level I, Level II and Level Ill based on the lowest level input that is significant to the fair value measurement as a whole. For detailed information on the fair value hierarchy, refer note no. 4.10. For assets and liabilities that are fair valued in the financial statements on a recurring basis, the Company determines whether transfers have occurred between levels in the hierarchy by re-assessing categorization (based on the lowest level input that is significant to the fair value measurement as a whole) at the end of each reporting period. For the purpose of fair value disclosures, the Company has determined classes of assets and liabilities on the basis of the nature, characteristics and risks of the asset or liability and the level of the fair value hierarchy. 1.2.12 Biological Assets Biological assets are classified as Bearer biological assetsand Consumable biological assets. Consumable biologicalassets are those that are to be harvested as agriculturalproduce or sold as biological assets. Bearer BiologicalAssets which are held to bear agricultural produce areclassified as Bearer plants. Tea bushes, Coffee bushes, Pepper vines, Cardamom tiller and Shade trees are recognised as Bearer biological assets. These are classified as mature Bearer Plants and Immature Bearer Plants. Mature Bearer Plants are those that have attained harvestable stage. Cost incurred for new plantations and immature areas are capitalised. Cost includes cost of land preparation, new planting and maintenance till maturity. The cost of areas coming into bearing is transferred to mature plantations and depreciated over their estimated useful lives. Bearer plants relating to Coffee and Tea bushes, Pepper vines and minor produces attain a harvestable stage in about 3-5 years. Bearer biological assets are carried at cost less accumulated depreciation and accumulated impairment loss, if any. Subsequent expenditure on bearer assets are added to its book value only when it is probable that future economic benefits associated with the item will flow to the."
  },
  {
    "element_id": 2374,
    "page_number": 159,
    "normalized_text": "The table contains the following information: Type of Login Method shareholders 1) Users who have opted for CDSL Easi / Easiest facility, can login through their existing Individual user id and password. Option will be made available to reach e-Voting page without any Shareholders further authentication. The users to login to Easi / Easiest are requested to visit cdsl holding website www.cdslindia.com and click on login icon & My Easi New (Token) Tab. securities in 2) After successful login the Easi / Easiest user will be able to see the e-Voting option for Demat mode eligible companies where the evoting is in progress as per the information provided by with CDSL company. On clicking the evoting option, the user will be able to see e-Voting page of the Depository e-Voting service provider for casting your vote during the remote e-Voting period or joining virtual meeting & voting during the meeting. Additionally, there is also links provided to access the system of all e-Voting Service Providers, so that the user can visit the e-Voting service providers’ website directly. 3) If the user is not registered for Easi/Easiest, option to register is available at cdsl website www.cdslindia.com and click on login & My Easi New (Token) Tab and then click on registration option. 4) Alternatively, the user can directly access e-Voting page by providing Demat Account Number and PAN No. from a e-Voting link available on www.cdslindia.com home page. The system will authenticate the user by sending OTP on registered Mobile & Email as."
  },
  {
    "element_id": 2414,
    "page_number": 161,
    "normalized_text": "The table contains the following information: Login type Helpdesk details Individual Shareholders holding securities in Members facing any technical issue in login can contact Demat mode with CDSL CDSL helpdesk by sending a request at helpdesk.evoting@cdslindia.com or contact at toll free no. 1800 21 09911 Individual Shareholders holding securities in Members facing any technical issue in login can contact Demat mode with NSDL NSDL helpdesk by sending a request at evoting@nsdl.co.in or."
  },
  {
    "element_id": 2521,
    "page_number": 167,
    "normalized_text": "The table contains the following information: Aspect Details Regulatory basis Section 188 (Companies Act), Regulation 23 (SEBI LODR), Rule 6A Nature of transactions Ordinary course of business; arm’s length Aggregate limit ₹2 crores for FY 2025-26 Review & oversight Quarterly Audit Committee review Disclosures required Stock exchange updates and website posting under Reg 23(9) Director/KMP interest None (unless to be disclosed at the meeting)."
  },
  {
    "element_id": 2532,
    "page_number": 168,
    "normalized_text": "The table contains the following information: Name Seema Mittal Father’s Name Laxmi Narain Dalmia Din 06948908 D.O.B. 22/06/1969 HN. 113/93 Shreedham Apartment Swaroop Nagar, Address KANPUR- 208002 Email- seemamittal1969@gmail.com Qualification Graduate She is business consultant and having good knowledge of Experience legal aspects of business matters with experience of more than sixteen years. Other Directorship NIL Shareholding In The Company NIL No. of Board Meeting Attended during Total Meeting held : 8 the financial year Attended: 8 Chairperson/Member of the committee Member in Stakeholders’ Relationship Committee of the board of directors of the company."
  },
  {
    "element_id": 2534,
    "page_number": 168,
    "normalized_text": "The table contains the following information: Name Vivek Awasthi Father’s Name Prakash Narain Awasthi Din 06961442 D.O.B. 22/11/1963 Address 128/348 K Block, Kidwai Nagar, Kanpur Nagar, Uttar Pradesh, 208011 Qualification Chartered Accountant Relationship With Kmp None Experience He is a qualified Chartered Accountant having immense experience in finance and Accounting. He has also served a Listed Entity as an Independent Director on their Board. Other Directorship Keymen Loans Distribution Limited (Additional Director - Independent as on date of submission of his declaration) Shareholding In The Company NIL No. of Board Meeting Attended during N.A the financial year Chairperson/Member of the committee N.A."
  }
]